{
  "backend/main.mo": "Core Motoko actor for the CyberGenesis Land Mint DApp implementing land registry, token claiming, upgrades, loot caches, modifiers, and access control with ordered maps for all state.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for force-reinstalling the Land and Asset Canisters on ICP mainnet, listing all five canister IDs and the authorized admin principal.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis covering environment configuration and frontend .env setup.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide for the CyberGenesis DApp covering prerequisites, canister creation sequence, and asset requirements.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration steps and ordered canister deployment instructions for CyberGenesis.",
  "DEVELOPER_README.md": "Developer documentation describing the five-canister ICP architecture (Land, Token, Marketplace, Governance, Asset) and inter-canister communication for the CyberGenesis NFT land platform.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing the required environment variables for the frontend .env file, including network and canister ID configuration.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister configuration errors by deploying backend canisters locally or on mainnet and configuring environment variables.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (MapView map configuration, edge-pinning logic, drone animation, etc.) to source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file describing their purpose and key implementation details.",
  "frontend/.env": "Production environment variable file permanently targeting ICP mainnet with all five canister IDs, admin principal, and stability/retry configuration for the frontend.",
  "frontend/.env.example": "Template environment variable file with placeholder canister IDs, network settings, retry configuration, and examples for both local and mainnet deployments.",
  "frontend/index.html": "Minimal HTML entry point for the CyberGenesis React app with cache-busting meta tags and a root div mounting the Vite/TSX module.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication state, actor initialization, and routing between LandingPage, Dashboard, and ProfileSetup based on identity and user profile data. Also handles actor reinitialization progress display and loading states.",
  "frontend/src/asset-backend.d.ts": "TypeScript type declarations for the asset backend canister interface, defining Asset, UserProfile, UserRole types and the assetBackendInterface with all callable methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, describing all service methods including asset management, user profiles, access control, and admin functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory definition for the main land/game backend canister, describing types and service methods for land data, rewards claiming, loot caches, modifiers, upgrades, and user profiles.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only React component for uploading GLB 3D model files to the asset canister, with authorization checks against a hardcoded admin principal, health checks, drag-and-drop support, and per-file upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component for uploading GLB land models to the asset canister, featuring periodic health checks, land type selection, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic panel component that runs a suite of tests against the asset canister including actor initialization, network connectivity, authentication, query calls, permissions, cycle balance, and inter-canister communication, displaying results with logs.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "A React component that provides a UI for reinitializing the Asset Canister, including authorization checks, pre/post health checks, and step-by-step progress tracking with toast notifications.",
  "frontend/src/components/CanisterDiagnostics.tsx": "A React component that runs connectivity health checks against multiple IC gateways for the Land and Asset canisters, displaying results, response times, and recommendations with optional auto-refresh.",
  "frontend/src/components/CanisterIDVerification.tsx": "A React component that compares expected canister IDs against environment variable values for all configured canisters, visually indicating which IDs are correct or mismatched.",
  "frontend/src/components/ConfigValidator.tsx": "A React component that validates required environment variables on load and renders a fixed error banner with a quick-fix guide if any critical configuration is missing.",
  "frontend/src/components/CosmicBackground.tsx": "A React component that renders an animated 2D canvas background featuring a twinkling star field and pulsing nebula effects using a cyberpunk color palette.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a 3D biome visualization using React Three Fiber with a dynamic FBM shader background, bloom post-processing, and biome-specific GLB models loaded via a URL map.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Displays health status of LandCanister and AssetCanister by polling their actors, showing per-canister status badges and a manual refresh button.",
  "frontend/src/components/Discovery.tsx": "Provides UI for discovering and processing loot caches of different tiers, checking CBR token and cycle-charge requirements before calling backend actor methods.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches rendering errors and displays a styled error overlay with the error message.",
  "frontend/src/components/Governance.tsx": "Governance UI allowing users to stake CBR tokens, create proposals, and vote on active proposals using React Query mutations and tabbed layout.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard for a selected land plot showing token balance, cooldown timer, claim rewards, upgrade plot, and modifier inventory actions via React Query hooks.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/LandModel.tsx": "Renders a 3D GLTF land model using React Three Fiber with KTX2 texture support, applying biome-specific PBR lighting, emissive intensity, and maximum anisotropic filtering.",
  "frontend/src/components/LandSelector.tsx": "UI component for navigating between a user's owned land plots, displaying the current land's name and biome with previous/next buttons.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with medal-style styling for the top three entries.",
  "frontend/src/components/MapView.tsx": "Renders an interactive 2D map of all land plots using Maptalks.js loaded via CDN, with biome-colored markers and a custom identity projection over a 2056×2056 game world image.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for browsing, buying, listing, and cancelling land and modifier listings, with filtering by type and price range.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Displays real-time network connectivity metrics (status, latency, uptime) by periodically pinging the asset canister and showing results in an expandable UI widget.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas background with 60 floating particles that draw connecting lines when within 150px of each other, using requestAnimationFrame for the animation loop.",
  "frontend/src/components/PlotCustomization.tsx": "UI card component that allows users to update the name (max 20 chars) and decoration URL of a selected land plot via mutation hooks.",
  "frontend/src/components/PlugWalletButton.tsx": "Button component for connecting/disconnecting a Plug Wallet; shows a dropdown with copy principal and disconnect options when connected, or a connect button when not.",
  "frontend/src/components/ProfileSetup.tsx": "Form card that prompts new users to enter their name and saves it as a user profile via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay that displays reconnection progress, showing the current attempt number, active gateway, and an animated progress bar during ICP connection reinitialization.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React class-based error boundary that catches 3D rendering errors, logs them, and renders a fallback UI with a retry button instead of crashing the canvas.",
  "frontend/src/config/mainnet.ts": "Defines and exports the ICP mainnet configuration including canister IDs, asset URLs, Internet Identity/Plug Wallet settings, and helper functions to initialize, validate, and retrieve model URLs.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration on ICP, exposing connection state, connect/disconnect methods, and actor creation utilities.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder NFT modifiers organized into four rarity tiers, intended to be replaced with backend data once modifier management is integrated.",
  "frontend/src/governance-backend.d.ts": "TypeScript type declarations for the governance backend canister, defining interfaces for Proposals, Votes, and result variants for staking and voting operations.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory for the governance backend canister, describing the service interface including staking, voting, and proposal management methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend canister actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage and invalidating dependent queries on identity change.",
  "frontend/src/hooks/useActorReinitializer.ts": "React hook that implements automatic actor reinitialization with up to 3 retry attempts, rotating through multiple IC gateway URLs with a delay between attempts and showing toast notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "React hook that wraps useActor with initialization polling logic, validating backend connectivity by running multiple canister queries with progressive backoff and a 120-second timeout.",
  "frontend/src/hooks/useAssetActor.ts": "React hook that initializes and returns an ICP Asset Canister actor with retry logic, multi-gateway failover, environment validation, and health checks. Supports both local and mainnet networks using Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that performs a single delayed health check against the Asset Canister's /health endpoint and returns a status of 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook that uploads GLB files to the Asset Canister via Plug wallet authentication, tracking upload progress and returning success/error results.",
  "frontend/src/hooks/useGovernanceActor.ts": "React hook that initializes and returns an ICP Governance Canister actor with retry logic and multi-gateway failover, using Internet Identity for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity state and status flags.",
  "frontend/src/hooks/useMarketplaceActor.ts": "React hook that initializes and returns an ICP Marketplace Canister actor with retry logic and multi-gateway failover, using Internet Identity for authentication.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query mutation hooks for interacting with token, marketplace, and governance canisters via Plug Wallet, including buy/list/cancel listing and stake/vote operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating land data, user profiles, token balances, and placeholder governance/marketplace operations using Internet Identity actors.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a typed ICP actor for the token canister with retry logic, gateway failover, and 120-second timeout support.",
  "frontend/src/index.css": "Global stylesheet defining a cyberpunk dark theme with Tailwind CSS, custom CSS variables, glassmorphism effects, and neon glow utilities using Orbitron and JetBrains Mono fonts.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version metadata for cache-busting and provides a utility to append version query parameters to URLs.",
  "frontend/src/lib/debugConfig.ts": "Provides conditional debug logging utilities for 3D scene diagnostics, including GPU context inspection, overlapping renderer detection, and performance monitoring, activated via env vars or query params.",
  "frontend/src/lib/modelLoader.ts": "File is empty or has no content.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 CBR token amount handling, including formatting raw bigint balances to human-readable strings, parsing decimal strings to raw units, adding thousands separators, and checking sufficient balance.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type declarations for the marketplace backend canister, defining Listing, BuyResult, ItemType, and the marketplaceBackendInterface with methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for the marketplace backend canister, describing the service interface including item listing, buying, and querying methods.",
  "frontend/src/pages/Collection.tsx": "Page component displaying the full modifier catalog with rarity tier counts (Common, Rare, Legendary, Mythic) and a styled grid of modifier cards from the planned catalog data.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches user land data and renders tabbed navigation across Land, Discovery, Collection, Leaderboard, Marketplace, Governance, and Map views with a land selector for multiple parcels.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login button, cosmic/particle backgrounds, and feature highlight cards for unauthenticated users.",
  "frontend/src/pages/MintingPage.tsx": "Transitional minting page that shows a loading spinner while land data initializes, then displays a success message before redirecting to the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Admin/debug page that renders the CanisterIDVerification component to validate that all canister IDs are correctly configured against deployed IC canisters.",
  "frontend/src/token-backend.d.ts": "TypeScript type declarations for the ICRC-1 token backend canister, defining Account, TransferArgs, TransferResult, MetadataValue types, and the full tokenBackendInterface including balance, transfer, minting, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines the Candid IDL factory for an ICRC-1 token canister, declaring types and service methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript ambient type declarations for the WebGPU API, covering GPU, GPUAdapter, GPUDevice, GPUQueue, and related interfaces to enable WebGPU support detection without type errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors, border radii, neon box shadows, accordion keyframes, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration for a React app targeting the Internet Computer, with environment variable injection, path aliases, dev-server proxy to a local DFX replica, COOP/COEP headers, and timestamped output chunks with manual vendor splitting.",
  "project_state.json": "Tracks the current state of the CyberLand map project, documenting architectural decisions for the maptalks-based MapView (image layer, spatial reference, cover-zoom logic, drone animation) and listing implemented features.",
  "README_RUSSIAN.md": "Russian-language quick-start deployment guide for CyberGenesis covering prerequisites and dependency installation.",
  "scripts/upload_assets_mainnet.sh": "Bash script that uploads all .glb 3D model files from a local assets directory to an ICP mainnet AssetCanister using dfx, with rate limiting and a final verification step.",
  "scripts/upload_assets.sh": "Bash script that batch-uploads 48 tiered GLB 3D model files to an ICP AssetCanister using DFX, then verifies the uploads and prints sample asset URLs.",
  "unknown.txt": "Partial documentation snippet referencing a step to test a health endpoint."
}