{
  "backend/main.mo": "Core Motoko actor for the CyberGenesis Land Mint DApp implementing land registry, NFT minting, token claiming, upgrades, loot caches, and modifier systems with access control and inter-canister communication.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for force-reinstalling the Land and Asset Canisters on ICP mainnet, listing all five canister IDs and an admin principal, with a critical pre-reinstall backup step.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis covering environment configuration, including instructions for creating a frontend `.env` file.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide for the CyberGenesis Land Mint DApp covering prerequisites, canister creation sequence, and requirements for 3D GLB assets and tooling.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Concise deployment instructions focused on critical environment configuration and the ordered deployment of all five canisters.",
  "DEVELOPER_README.md": "Developer documentation describing the CyberGenesis multi-canister ICP architecture (Land, Token, Marketplace, Governance, Asset canisters) and marking the project as audit-ready.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing the critical environment variables required in `frontend/.env`, focused on network and canister ID configuration.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving 'Asset Canister ID not configured' and availability errors by deploying backend canisters locally or to mainnet and configuring environment variables.",
  "feature_evidence.json": "Feature evidence report JSON documenting implemented features in `CubeVisualization.tsx` and `MapView.tsx`, including bloom render buffer fixes, WebGL autoClear configuration, and Leaflet map integration, with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key implementation details of components, pages, hooks, and styles.",
  "frontend/.env": "Production environment variable file permanently targeting ICP mainnet (`ic`), defining all five canister IDs, admin principal, gateway URLs, retry/timeout settings, and deployment instructions.",
  "frontend/.env.example": "Template environment variable file with placeholder values for all required configuration including canister IDs, network settings, Internet Identity URL, retry parameters, and examples for both local and mainnet deployments.",
  "frontend/index.html": "Minimal HTML entry point for the CyberGenesis React app with cache-busting meta tags, a root div, and a module script loading `main.tsx`.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication state, actor initialization, and routing between LandingPage, Dashboard, and ProfileSetup based on identity and user profile status. Also handles actor reinitialization progress display and loading states.",
  "frontend/src/asset-backend.d.ts": "TypeScript type declarations for the asset backend canister interface, defining Asset, UserProfile, UserRole types and the full assetBackendInterface with all callable methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, describing all service methods including asset management, user profiles, access control, and admin functions using @dfinity/candid.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main land/game backend canister, defining complex types (LandData, ClaimResult, LootCache, Modifier, etc.) and all service methods for gameplay, land management, and admin operations.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only React component for uploading GLB 3D model files to the asset canister, with authorization checks against a hardcoded admin principal, health checks, drag-and-drop support, and per-file upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component providing a collapsible UI for uploading GLB land models by type, with periodic asset canister health checks, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic panel component that runs a suite of 8 tests against the asset canister (actor init, network, auth, queries, permissions, cycle balance, GLB inventory, inter-canister comms) and displays timestamped logs and results.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "A React component that provides a UI for reinitializing the Asset Canister, including authorization checks, pre/post health checks, and step-by-step progress tracking with toast notifications.",
  "frontend/src/components/CanisterDiagnostics.tsx": "A React component that runs connectivity health checks against multiple IC gateways for the Land and Asset canisters, displaying results with status badges and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "A React component that compares expected canister IDs against environment variable values for all project canisters, visually flagging any mismatches.",
  "frontend/src/components/ConfigValidator.tsx": "A React component that validates required environment variables on load and renders a prominent error banner with a quick-fix guide if any critical variables are missing.",
  "frontend/src/components/CosmicBackground.tsx": "A React component that renders an animated 2D canvas background featuring a twinkling star field and pulsing nebula effects using a cyberpunk color palette.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a 3D biome visualization using React Three Fiber with post-processing effects including bloom, ACES tone mapping, CAS sharpening, and specular glints. Maps biome types to GLB model URLs and composes a multi-pass rendering pipeline.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Displays health status of LandCanister and AssetCanister by polling their actors, showing online/offline badges and allowing manual refresh with query invalidation.",
  "frontend/src/components/Discovery.tsx": "Provides UI for discovering and processing loot caches on a player's land, handling tier-based CBR token and cycle-charge costs with result feedback via toasts.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches rendering errors and displays a styled error overlay with the error message.",
  "frontend/src/components/Governance.tsx": "Governance UI allowing users to stake CBR tokens, create proposals, and vote on active proposals, with result handling and toast notifications.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard for a selected land plot showing token balance, cooldown timer, claim rewards, plot upgrades, and modifier application with admin debug tools.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/LandModel.tsx": "Loads and renders a GLTF 3D land model with KTX2 texture support, applying biome-specific PBR material settings (emissive intensity, env map intensity, anisotropic filtering) and auto-fitting the camera to the model bounds.",
  "frontend/src/components/LandSelector.tsx": "A UI component that displays a paginated land selector with previous/next navigation buttons, showing the current land's name, biome (in Russian), and position index.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with gold/silver/bronze styling for the top three entries, fetched via the useGetTopLands hook.",
  "frontend/src/components/MapView.tsx": "Renders a full-screen interactive Leaflet map using a pixel-coordinate CRS overlaid with a game world image, drawing neon-colored polylines from the map center to each land plot based on biome.",
  "frontend/src/components/Marketplace.tsx": "A marketplace UI supporting browsing, filtering, buying, listing, and cancelling listings for land and modifier items, with price/type filters and toast notifications for transaction results.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Periodically pings the asset canister every 10 seconds to measure latency and connection status, displaying a collapsible network health widget with color-coded connected/disconnected/checking states.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas background with 60 floating particles that draw connecting lines when within 150px of each other, using requestAnimationFrame for the animation loop.",
  "frontend/src/components/PlotCustomization.tsx": "UI card component that allows users to update the name (max 20 chars) and decoration URL of a selected land plot via mutation hooks.",
  "frontend/src/components/PlugWalletButton.tsx": "Button component for connecting/disconnecting a Plug Wallet; shows a dropdown with copy principal and disconnect options when connected, or a connect button when not.",
  "frontend/src/components/ProfileSetup.tsx": "Form card that prompts new users to enter their name and saves it as a user profile via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay that displays reconnection progress, showing current attempt number, max attempts, active gateway, and an animated progress bar during ICP network reinitialization.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React class-based error boundary that catches 3D rendering errors, logs them, and renders a fallback UI with a retry button instead of crashing the canvas.",
  "frontend/src/config/mainnet.ts": "Defines and exports the ICP mainnet configuration including canister IDs, asset URLs, Internet Identity/Plug Wallet settings, and helper functions to initialize, validate, and retrieve model URLs.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration on the Internet Computer, exposing connection state, connect/disconnect methods, and actor creation utilities.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder NFT modifiers organized into four rarity tiers (Common, Rare, Legendary, and a fourth tier), intended to be replaced with backend data.",
  "frontend/src/governance-backend.d.ts": "TypeScript type declarations for the governance canister backend, defining interfaces for Proposals, Votes, and result variants for staking and voting operations.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory for the governance backend canister, describing the service interface including staking, proposal creation, and voting methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "React hook that manages automatic actor reinitialization by cycling through multiple IC gateways with up to three retry attempts and progressive delays, showing toast notifications on success or failure.",
  "frontend/src/hooks/useActorWithInit.ts": "React hook that wraps useActor to track initialization state, polling the backend with progressive backoff to validate network connectivity across multiple canister queries before marking the actor as ready.",
  "frontend/src/hooks/useAssetActor.ts": "React hook that initializes and returns an ICP Asset Canister actor with retry logic, multi-gateway failover, environment validation, and Internet Identity authentication support.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that performs a delayed health check against the Asset Canister's /health endpoint and returns a status of 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook that uploads GLB files to the Asset Canister via the Plug wallet agent, tracking upload progress and returning success/error results.",
  "frontend/src/hooks/useGovernanceActor.ts": "React hook that initializes and returns an ICP Governance Canister actor with retry logic, multi-gateway failover, and Internet Identity authentication support.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity and login status to consumers.",
  "frontend/src/hooks/useMarketplaceActor.ts": "React hook that initializes and returns an ICP Marketplace Canister actor with retry logic, multi-gateway failover, and Internet Identity authentication support.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query mutation hooks for interacting with token, marketplace, and governance canisters via Plug Wallet, including buy/list/cancel listing and stake/vote operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating land data, user profiles, token balances, governance proposals, and marketplace listings using Internet Identity-authenticated actors.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a typed ICP actor for the token canister with retry logic, gateway failover, and optional Internet Identity authentication.",
  "frontend/src/index.css": "Global stylesheet defining a cyberpunk dark theme with Tailwind CSS, custom CSS variables, glassmorphism effects, and neon glow utility classes.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version info for cache-busting and provides a utility to append version query parameters to URLs.",
  "frontend/src/lib/debugConfig.ts": "Provides conditional debug logging utilities for 3D scene diagnostics, including GPU context inspection, renderer detection, and performance monitoring, activated via env vars or query params.",
  "frontend/src/lib/modelLoader.ts": "File is empty or truncated with no content provided.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 CBR token amount handling, including formatting raw bigint balances to human-readable strings, parsing decimal strings to raw units, adding thousands separators, and checking sufficient balance.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type declarations for the marketplace backend canister, defining Listing, BuyResult, ItemType, and the marketplaceBackendInterface with listing/buying/canceling methods.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for the marketplace backend canister, describing the service interface including list_item, buy_item, and listing query methods.",
  "frontend/src/pages/Collection.tsx": "Page component displaying the full modifier catalog with rarity tier counts and a styled grid of modifier cards, using data from the planned modifier catalog.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches user land data and renders tabbed navigation across Land, Discovery, Collection, Leaderboard, Marketplace, Governance, and Map views with a land selector for multiple parcels.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login button, cosmic/particle backgrounds, and feature highlight cards for unauthenticated users.",
  "frontend/src/pages/MintingPage.tsx": "Transitional minting page that shows a loading spinner while land data initializes, then displays a success message before redirecting to the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Utility page that renders the CanisterIDVerification component to verify all canister IDs are correctly configured against deployed IC canisters.",
  "frontend/src/token-backend.d.ts": "TypeScript type declarations for the ICRC-1 token backend canister, defining Account, TransferArgs, TransferResult, MetadataValue types, and the full tokenBackendInterface including balance, transfer, mint, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines the Candid IDL factory for an ICRC-1 token canister, declaring types and service methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript ambient type declarations for the WebGPU API, covering GPU, GPUAdapter, GPUDevice, GPUQueue, and related interfaces, plus extending Navigator with an optional gpu property.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with helpers to persist values in sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, neon box shadows, accordion keyframes, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration for a React app targeting the Internet Computer, with timestamp-based cache busting, WASM asset handling, proxy to local DFX replica, COOP/COEP headers, and manual chunk splitting for React and Three.js vendors.",
  "project_state.json": "Project state document tracking the Cyberland app's architecture, known issues (black screen in CubeVisualisation due to bloom buffer mismanagement), and pending feature/fix tasks for the 3D cube view and Leaflet map view.",
  "README_RUSSIAN.md": "Russian-language quick-start guide for CyberGenesis covering prerequisites (Node.js, dfx) and dependency installation steps.",
  "scripts/upload_assets_mainnet.sh": "Bash script that uploads all .glb 3D model files from a local assets directory to an ICP mainnet AssetCanister using dfx, with rate limiting and a final verification step.",
  "scripts/upload_assets.sh": "Bash script that batch-uploads 48 tiered GLB 3D model files to an ICP AssetCanister using dfx, then verifies and reports the uploaded asset count and sample URLs.",
  "unknown.txt": "Partial documentation snippet referencing a step to test a health endpoint."
}