{
  "backend/main.mo": "Core Motoko actor for the CyberGenesis Land Mint DApp implementing land registry, token claiming, upgrades, loot caches, modifiers, and access control with ordered maps for all state.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for force-reinstalling the Land and Asset Canisters on ICP mainnet, listing all five canister IDs and the authorized admin principal.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis covering environment configuration and required frontend .env variables.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide for the CyberGenesis DApp detailing prerequisites and the ordered sequence for deploying all five canisters with 3D assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Concise deployment instructions focused on critical environment configuration and the correct canister deployment order.",
  "DEVELOPER_README.md": "Developer documentation describing the CyberGenesis multi-canister architecture, listing all five canisters and their source files, and noting the project is ready for audit.",
  "ENVIRONMENT_CONFIGURATION.md": "Reference guide listing all required frontend environment variables and network configuration settings for the application.",
  "ENVIRONMENT_SETUP.md": "Troubleshooting guide for resolving 'Asset Canister ID not configured' and availability errors by walking through local and mainnet canister deployment steps.",
  "feature_evidence.json": "Feature evidence report documenting two specific numeric-value changes: Bloom post-processing settings in CubeVisualization.tsx and emissiveIntensity values in LandModel.tsx biomeConfigs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, describing each component's purpose and key implementation details.",
  "frontend/.env": "Production environment configuration file permanently targeting ICP mainnet with all five canister IDs, admin principal, and stability/retry settings for the frontend.",
  "frontend/.env.example": "Template environment file documenting all required VITE_ variables with example values for both local development and mainnet deployment.",
  "frontend/index.html": "Minimal HTML entry point for the React app with no-cache headers, a root div, and the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, actor initialization, and routing between LandingPage, Dashboard, and ProfileSetup based on user identity and profile status. Also handles actor reinitialization progress display.",
  "frontend/src/asset-backend.d.ts": "TypeScript type declarations for the asset backend canister interface, defining Asset, UserProfile, UserRole types and the assetBackendInterface with all available canister methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, describing all service methods including asset management, user profiles, access control, and admin functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory definition for the main backend canister, describing data types (LandData, ClaimResult, LootCache, Modifier, etc.) and all service methods for land management, rewards, and governance.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only component for uploading GLB 3D model files to the asset canister, restricted to a hardcoded authorized principal with health checks, drag-and-drop support, and per-file upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component for uploading GLB land models by type, with periodic asset canister health checks, file validation, and simulated upload progress UI.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic panel component that runs a suite of tests against the asset canister (actor init, network, auth, queries, permissions, cycle balance, GLB inventory, inter-canister comms) and displays results with logs.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "A React component that provides a UI for reinitializing the Asset Canister, including authorization checks, pre/post health checks, and step-by-step progress tracking with toast notifications.",
  "frontend/src/components/CanisterDiagnostics.tsx": "A React component that runs connectivity health checks against multiple IC gateways for the Land and Asset canisters, displaying results with status badges and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "A React component that compares expected canister IDs against environment variable values and displays a verification card highlighting any mismatches.",
  "frontend/src/components/ConfigValidator.tsx": "A React component that validates required environment variables on mount and renders a fixed error banner with a quick-fix guide if any critical variables are missing.",
  "frontend/src/components/CosmicBackground.tsx": "A React component that renders an animated 2D canvas cosmic background featuring twinkling stars and pulsing nebula effects using requestAnimationFrame.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders a 3D biome visualization with selective bloom post-processing, an animated FBM shader background, and a camera-synced key light, loading GLB models based on a biome prop.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "UI component that periodically checks the health of the LandCanister and AssetCanister by calling their actors, displaying status badges and allowing manual refresh.",
  "frontend/src/components/Discovery.tsx": "Component for discovering and processing loot caches on a player's land, handling tier-based CBR token and cycle-charge costs with result feedback via toasts.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches rendering errors and displays a styled error overlay with the error message.",
  "frontend/src/components/Governance.tsx": "Governance UI component that lets users stake CBR tokens, create proposals, and vote on active proposals, using React Query mutations and displaying results via toasts.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard component for a selected land plot that displays token balance, cooldown timer, and supports claiming rewards, upgrading plots, and applying modifiers.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/LandModel.tsx": "Loads and renders a GLTF 3D land model with KTX2 texture support, applying biome-specific PBR material settings (emissive intensity, env map intensity, anisotropic filtering) and auto-fitting the camera to the model bounds.",
  "frontend/src/components/LandSelector.tsx": "A UI component that displays a paginated land selector with previous/next navigation buttons, showing the current land's name, biome (in Russian), and position index.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with gold/silver/bronze styling for the top three entries, fetched via the useGetTopLands hook.",
  "frontend/src/components/MapView.tsx": "Renders an interactive 2D map using Maptalks.js (loaded via CDN) with an identity projection, displaying all lands as neon-colored UIMarkers with biome-specific colors and highlighting the current user's land.",
  "frontend/src/components/Marketplace.tsx": "A marketplace UI supporting buying, listing, and cancelling listings for lands and modifiers, with filtering by type and price range, using React Query mutations and toast notifications for feedback.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Periodically pings the asset canister every 10 seconds to measure latency and connection status, displaying an expandable network diagnostics widget with color-coded connected/disconnected/checking states.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas background with 60 floating colored particles that draw connecting lines when within 150px of each other, with cleanup on unmount.",
  "frontend/src/components/PlotCustomization.tsx": "UI card component that allows users to update the name (max 20 chars) and decoration URL of a selected land plot via mutation hooks.",
  "frontend/src/components/PlugWalletButton.tsx": "Button component for connecting/disconnecting a Plug Wallet; shows a dropdown with principal ID copy and disconnect options when connected.",
  "frontend/src/components/ProfileSetup.tsx": "Form card that prompts new users to enter their name and creates a profile via the `useSaveCallerUserProfile` mutation, showing toast notifications on success or failure.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay that displays reconnection progress, showing current attempt number, active gateway, and an animated progress bar during ICP network reinitialization.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React class-based error boundary that catches 3D rendering errors, logs them, and renders a fallback UI with a retry button instead of crashing the canvas.",
  "frontend/src/config/mainnet.ts": "Defines and exports ICP mainnet configuration including canister IDs, asset URL helpers, Internet Identity/Plug Wallet settings, and utility functions for initialization, validation, and model URL generation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration on the Internet Computer, exposing connection state, connect/disconnect methods, and actor creation utilities.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder NFT modifiers organized into four rarity tiers (Common, Rare, Legendary, and a fourth tier), intended to be replaced with backend data.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for the governance canister backend, declaring interfaces for Proposal, Vote, StakeResult, VoteResult, and the governance service methods.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory for the governance backend canister, defining the on-chain interface including staking, proposal creation, voting, and query methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend canister actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "React hook that implements automatic actor reinitialization with up to 3 retry attempts, rotating through multiple IC gateway URLs with a delay between attempts and toast notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "React hook that wraps useActor with initialization polling logic, running up to 25 attempts with progressive backoff to validate backend connectivity via multiple canister queries.",
  "frontend/src/hooks/useAssetActor.ts": "React hook that initializes and returns an ICP Asset Canister actor with retry logic, multi-gateway failover, environment validation, and health checks. Supports both local and mainnet networks using Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that checks the health of the Asset Canister by fetching its /health endpoint after a 1-second delay, returning a status of 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using the Plug wallet agent, tracking upload progress and exposing upload state including errors.",
  "frontend/src/hooks/useGovernanceActor.ts": "React hook that initializes and returns an ICP Governance Canister actor with retry logic and multi-gateway failover, using Internet Identity for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and exposing login status flags.",
  "frontend/src/hooks/useMarketplaceActor.ts": "React hook that initializes and returns an ICP Marketplace Canister actor with retry logic and multi-gateway failover, using Internet Identity for authentication.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query mutation hooks for executing transactions via Plug Wallet against token, marketplace, and governance canisters. Includes specific hooks for buying/listing/canceling marketplace items and staking governance tokens.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating land data, user profiles, token balances, and placeholder governance/marketplace data using Internet Identity-authenticated actors.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes and returns an authenticated ICP actor for the token canister with retry logic, gateway failover, and a 120-second timeout.",
  "frontend/src/index.css": "Global stylesheet defining a cyberpunk dark theme with Tailwind CSS, custom CSS variables, glassmorphism effects, and neon glow utility classes using Orbitron and JetBrains Mono fonts.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version info for cache-busting and provides a utility to append version query parameters to URLs.",
  "frontend/src/lib/debugConfig.ts": "Provides conditional debug logging utilities for 3D scene diagnostics, including GPU context inspection, overlapping renderer detection, and performance monitoring, activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File is empty or contains no content.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 CBR token amount handling, including formatting raw bigint balances to human-readable strings, parsing decimal strings to raw units, adding thousands separators, and checking sufficient balance.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for the marketplace backend canister, declaring Listing, BuyResult, ItemType, and the marketplaceBackendInterface with methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for the marketplace backend canister, describing the service interface including item listing, buying, and querying methods.",
  "frontend/src/pages/Collection.tsx": "Page component that displays the full modifier catalog with rarity tiers (Common, Rare, Legendary, Mythic), showing counts per tier and a grid of modifier cards with tier-specific styling.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches user land data and renders tabbed navigation across Land, Discovery, Collection, Leaderboard, Marketplace, Governance, and Map views with a land selector for multiple parcels.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login button, cosmic/particle backgrounds, and feature highlight cards for unauthenticated users.",
  "frontend/src/pages/MintingPage.tsx": "Transitional page shown while land data is being initialized, displaying a loading spinner and redirecting to the dashboard once complete.",
  "frontend/src/pages/VerificationPage.tsx": "Admin/debug page that renders the CanisterIDVerification component to validate that all canister IDs are correctly configured against deployed IC canisters.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for the ICRC-1 token backend canister, declaring Account, TransferArgs, TransferResult, MetadataValue types, and the full tokenBackendInterface including balance, transfer, mint, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines the Candid IDL factory for an ICRC-1 token backend canister, exposing methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for the WebGPU API, including GPU, GPUAdapter, GPUDevice, GPUQueue, and related interfaces to enable WebGPU support detection without type errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, neon box shadows, and accordion keyframe animations, using typography, container-queries, and animate plugins.",
  "frontend/vite.config.ts": "Vite build configuration for a React frontend targeting ICP canisters, with environment variable injection, path aliases, WASM asset handling, manual chunk splitting, and a dev proxy to the local DFX replica.",
  "project_state.json": "Tracks the current project state for a 3D Crystal Glass visualization, recording existing features (bloom and emissive intensity calibration), architectural notes, and build metadata.",
  "README_RUSSIAN.md": "Russian-language quick-start guide covering prerequisites and dependency installation for the CyberGenesis ICP DApp.",
  "scripts/upload_assets_mainnet.sh": "Bash script for uploading GLB model assets to an ICP AssetCanister on mainnet, with rate limiting between uploads, success/failure tracking, and a post-upload verification step.",
  "scripts/upload_assets.sh": "Bash script that batch-uploads 48 tiered GLB 3D model files to an ICP AssetCanister on localhost using DFX, then verifies and lists the uploaded assets.",
  "unknown.txt": "A near-empty file containing only a partial note about testing a health endpoint."
}