{
  "kind": "build_request",
  "title": "Crystal Glass calibration: numeric-only bloom and emissiveIntensity adjustments",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In CubeVisualization.tsx, update only the following numeric values in the Bloom post-processing pass: set intensity to 0.15, set radius to 0.5, set luminanceThreshold to 0.1. Do NOT modify smoothing, any other Bloom properties, any other post-processing passes, or any other logic or structure in the file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In CubeVisualisation.tsx (Bloom settings): Set intensity to 0.15, Set radius to 0.5, Set luminanceThreshold to 0.1, Do NOT touch smoothing or any other post-processing passes"
        ]
      },
      "acceptanceCriteria": [
        "Bloom intensity value is exactly 0.15",
        "Bloom radius value is exactly 0.5",
        "Bloom luminanceThreshold value is exactly 0.1",
        "All other Bloom properties (e.g., smoothing) remain unchanged",
        "No other post-processing passes are modified",
        "No logic, structure, metalness, or roughness settings are changed"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In LandModel.tsx, within the biomeConfigs block, change emissiveIntensity from 1.5 to 1.0 for every biome entry. Do NOT change the pulse value (keep it at 0.15), do NOT modify any other material properties, and do NOT touch any geometry logic or structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In LandModel.tsx (biomeConfigs block): Change emissiveIntensity from 1.5 to 1.0 for ALL biomes. Keep the pulse at 0.15 as previously set. Do NOT touch any other material properties or geometry logic."
        ]
      },
      "acceptanceCriteria": [
        "Every biome entry in biomeConfigs has emissiveIntensity set to exactly 1.0",
        "No biome entry retains the old value of 1.5",
        "Pulse value remains at 0.15 for all biomes",
        "No other material properties (metalness, roughness, envMapIntensity, etc.) are altered",
        "No geometry logic or structural code is changed"
      ]
    }
  ],
  "constraints": [
    "Only swap the specified numeric values — no logic, structure, metalness, roughness, or other material/post-processing settings may be touched",
    "Do not alter any files other than CubeVisualization.tsx and LandModel.tsx"
  ],
  "nonGoals": [
    "Changing any Bloom properties other than intensity, radius, and luminanceThreshold",
    "Modifying smoothing or any other post-processing pass",
    "Changing metalness, roughness, envMapIntensity, or any other PBR material property",
    "Changing geometry logic or scene structure",
    "Modifying the pulse value in biomeConfigs",
    "Any backend changes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}