{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Crystal Glass calibration: numeric-only bloom and emissiveIntensity adjustments",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Bloom post-processing numeric values (intensity, radius, luminanceThreshold) in CubeVisualization.tsx without modifying any other properties or logic",
      "acceptanceCriteria": [
        "Bloom intensity value is exactly 0.15",
        "Bloom radius value is exactly 0.5",
        "Bloom luminanceThreshold value is exactly 0.1",
        "All other Bloom properties (e.g., smoothing) remain unchanged",
        "No other post-processing passes are modified",
        "No logic, structure, metalness, or roughness settings are changed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CubeVisualization.tsx",
          "operation": "modify",
          "description": "Locate the Bloom post-processing pass configuration. Update only the numeric values: set intensity to 0.15, set radius to 0.5, set luminanceThreshold to 0.1. Do not modify the smoothing property, any other Bloom properties, any other post-processing passes (e.g., EffectComposer, RenderPass), or any other logic in the file. Preserve all existing imports, component structure, GLB loading logic, camera setup, lighting, and shader background exactly as-is."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Change emissiveIntensity from 1.5 to 1.0 for all biome entries in LandModel.tsx biomeConfigs without touching pulse, other material properties, or geometry logic",
      "acceptanceCriteria": [
        "Every biome entry in biomeConfigs has emissiveIntensity set to exactly 1.0",
        "No biome entry retains the old value of 1.5",
        "Pulse value remains at 0.15 for all biomes",
        "No other material properties (metalness, roughness, envMapIntensity, etc.) are altered",
        "No geometry logic or structural code is changed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LandModel.tsx",
          "operation": "modify",
          "description": "Locate the biomeConfigs object/array. For every biome entry within biomeConfigs, change the emissiveIntensity value from 1.5 to 1.0. Do not modify the pulse value (keep it at 0.15), do not change any other PBR material properties (metalness, roughness, envMapIntensity, etc.), and do not alter GLTF loading logic, KTX2 texture support, camera fitting, or any geometry/scene structure. Only swap the emissiveIntensity numeric value for all biomes."
        }
      ]
    }
  ]
}