{
  "backend/main.mo": "Primary Motoko canister implementing land minting logic, data types, registries, and utility functions for CyberGenesis.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for performing a forced full reinstall of Land and Asset canisters on IC mainnet, including prerequisites and backup requirements.",
  "DEPLOYMENT_CHECKLIST.md": "High‑level deployment checklist covering environment configuration and required variables before deploying CyberGenesis.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide detailing prerequisites and the full sequence for deploying CyberGenesis Land Mint DApp and assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Short deployment instruction file describing critical environment setup and the order for deploying all canisters.",
  "DEVELOPER_README.md": "Developer documentation describing system architecture, multi‑canister design, and overall DApp functionality.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing required environment variables for frontend/.env and network configuration details.",
  "ENVIRONMENT_SETUP.md": "Environment setup guide explaining how to configure variables and deploy backend canisters for resolving common errors.",
  "feature_evidence.json": "Feature evidence report listing shader integration requirements for CubeVisualization.tsx with associated files and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of key frontend files.",
  "frontend/.env": "Production environment file containing mainnet canister IDs, network settings, and admin configuration.",
  "frontend/.env.example": "Template environment file showing required variables, canister IDs, and debug options for local or mainnet use.",
  "frontend/index.html": "Base HTML entry point loading the Vite/React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component managing identity, actor initialization, profile checks, and conditional rendering for loading, reinitialization, and authenticated pages.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister, including asset types, user profiles, roles, and all backend method signatures.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory defining the asset backend service including asset operations, admin queries, access control, and user profile functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory defining the main backend canister with land data, rewards, modifiers, loot caches, and user/admin role functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only GLB model upload UI handling health checks, authorization, drag/drop, and upload progress management.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel for uploading GLB files with health checks, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostics tool running multi-step tests on the asset canister, logging results, checking connectivity, permissions, and cycle balance.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Provides an admin-only UI workflow to run prechecks, reinitialize the Asset Canister, and perform postchecks with step tracking and authorization checks.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs connectivity and health diagnostics for canisters across multiple gateways, producing status reports and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays correctness of environment‑configured canister IDs by comparing current and expected values for several canisters.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and shows a fixed critical‑error banner when configuration is invalid.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D starfield and nebula background using a canvas with resize and animation handling.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a biome-based 3D scene with Three.js, including lighting, shaders, environment, and model loading.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all rendering logic was moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks health of Land and Asset canisters, updates status, and shows diagnostic UI with refresh and icons.",
  "frontend/src/components/Discovery.tsx": "Displays land and token info, loads and processes loot caches, and triggers cache discovery with cost checks.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches component errors and displays a styled fallback message.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting UI with hooks for governance canister interactions.",
  "frontend/src/components/LandDashboard.tsx": "Shows land stats, rewards, upgrades, cooldown tracking, and modifier actions with admin debug options.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty or missing implementation.",
  "frontend/src/components/LandModel.tsx": "Loads and configures a GLTF land model with biome‑based emissive and PBR settings, using KTX2 textures and real‑time updates in Three.js.",
  "frontend/src/components/LandSelector.tsx": "Displays land info with Russian biome names and provides previous/next navigation between land entries.",
  "frontend/src/components/Leaderboard.tsx": "Shows a top‑10 land leaderboard with token balances, loading/error states, and styled ranking cards.",
  "frontend/src/components/MapView.tsx": "Renders an interactive canvas map with drag, pinch, and zoom gestures and highlights the user’s land via coordinate‑based positioning.",
  "frontend/src/components/Marketplace.tsx": "Implements buying, listing, filtering, and managing marketplace items including lands and modifiers with UI dialogs and mutation handlers.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Runs periodic health checks against the asset canister, tracking latency, connection state, and uptime with expandable UI status display.",
  "frontend/src/components/ParticleBackground.tsx": "Animated 2D canvas particle background with motion, linking lines, resize handling, and cleanup of animation frames.",
  "frontend/src/components/PlotCustomization.tsx": "UI for editing a land plot's name and decoration URL using mutation hooks with validation and loading states.",
  "frontend/src/components/PlugWalletButton.tsx": "Wallet button that connects to Plug, shows principal info in a dropdown, and supports copy and disconnect actions.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing users to submit a name, with mutation handling and success/error toasts.",
  "frontend/src/components/ReinitializationProgress.tsx": "Fullscreen overlay showing reconnection progress with attempt count, gateway info, and animated indicators.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary catching 3D rendering errors, logging them, and showing a fallback UI with reset capability.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration defining canister IDs, URLs, feature flags, wallet settings, and utilities for validation and initialization.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides a React context for Plug Wallet connection, handling connect/disconnect, actor creation, and connection state.",
  "frontend/src/data/modifierCatalog.ts": "Exports a static placeholder catalog of modifiers grouped by rarity tiers with IDs, names, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "Defines TypeScript interfaces and result variants for governance backend types, proposals, voting, and staking APIs.",
  "frontend/src/governance-backend.idl.ts": "Declares the Candid IDL service for the governance backend, including proposal, voting, and staking methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on identity and reinitializes queries when the actor changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook that retries actor creation across multiple gateways with delays and toast notifications on success or failure.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization logic, timeout handling, and polling backend health checks before marking ready.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and validates the asset canister actor with environment checks, gateway health testing, and retry logic for robust initialization.",
  "frontend/src/hooks/useAssetHealth.ts": "Performs a delayed health check against the asset canister’s /health endpoint and returns a simple health status.",
  "frontend/src/hooks/useAssetUpload.ts": "Provides logic for uploading GLB files to the asset canister using Plug wallet authentication and progress tracking.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes the governance canister actor with Internet Identity, retry logic, gateway selection, and timeout handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login flow, and stored identities.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes the marketplace canister actor with identity support, retry logic, and gateway failover similar to the governance actor.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides generic and specific Plug Wallet transaction hooks for token, marketplace, and governance canisters using react‑query mutations.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for land data, user profiles, tokens, and placeholder governance/marketplace types using react‑query.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes the token canister actor with gateway failover, retries, timeout handling, and Internet Identity integration.",
  "frontend/src/index.css": "Global styles with Tailwind, dark theme variables, neon glow effects, and glassmorphism UI elements.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp/version helpers and utilities for cache‑busting URLs and logging build info.",
  "frontend/src/lib/debugConfig.ts": "Provides debug utilities for 3D components, including logs, GPU diagnostics, performance timers, and renderer detection.",
  "frontend/src/lib/modelLoader.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/tokenUtils.ts": "Provides helpers to format and parse token amounts using configurable decimals, including thousands separators and balance checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript definitions for marketplace canister types, listings, buy results, and service methods.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory defining marketplace canister types and service endpoints.",
  "frontend/src/pages/Collection.tsx": "Renders a modifier collection page with rarity tiers and visual cards based on a catalog.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard handling land data fetching, tab navigation, and rendering multiple feature views.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen that handles Internet Identity login with visual effects and error messaging.",
  "frontend/src/pages/MintingPage.tsx": "Displays land initialization status and loading states while fetching actor and land data.",
  "frontend/src/pages/VerificationPage.tsx": "Page for verifying canister IDs with a styled UI and link back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for ICRC-1 token canister accounts, transfers, errors, metadata, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines the ICRC-1 token canister IDL with account, transfer, metadata, and mint interfaces.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript type declarations for WebGPU APIs to allow compile‑time support detection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, container settings, and plugin integrations.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, WASM asset handling, custom build filenames, and dev server proxying.",
  "project_state.json": "Project metadata describing shader‑related requirements, state, and existing feature tracking.",
  "README_RUSSIAN.md": "Russian‑language quickstart guide for installing dependencies and running CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet script to upload .glb assets to the AssetCanister with rate limiting and verification.",
  "scripts/upload_assets.sh": "Local network script to batch upload 3D model assets to an AssetCanister using dfx.",
  "unknown.txt": "Contains an incomplete line referencing testing a health endpoint."
}