{
  "backend/main.mo": "Main Land Canister actor implementing core NFT land minting logic with coordinates, biomes, upgrades, token claims, loot caches, modifiers, and access control using OrderedMap storage.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for performing a forced full reinstall of Land and Asset canisters on IC mainnet, including backup procedures and canister IDs for all five system canisters.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis requiring environment configuration in frontend/.env file with canister IDs and network settings.",
  "DEPLOYMENT_GUIDE.md": "Comprehensive mainnet deployment guide covering prerequisites, canister creation sequence, and deployment of 45+ 3D model assets (.glb files) to the Internet Computer.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration instructions emphasizing correct deployment order for all five canisters in the CyberGenesis system.",
  "DEVELOPER_README.md": "Complete developer documentation describing the multi-canister architecture (Land, Token, Marketplace, Governance, Asset), inter-canister communication, and project status as audit-ready.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide detailing required environment variables for network configuration in frontend/.env, focusing on canister IDs and network endpoints.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister configuration errors by deploying backend canisters locally or to mainnet and configuring environment variables.",
  "feature_evidence.json": "Feature evidence report documenting five rendering improvements: removing incorrect dithering code, adding dithering to Canvas gl prop, adjusting envMap intensities, updating emissive pulse logic, and configuring Bloom post-processing parameters.",
  "frontend-file-summaries.txt": "Detailed summaries of frontend components including 3D rendering (CubeVisualization, LandModel), UI pages (Dashboard, LandingPage), map view with physics, particle backgrounds, and Russian-language interfaces with glassmorphism styling.",
  "frontend/.env": "Production environment configuration permanently set to IC mainnet (ic network) with all five canister IDs, admin principal authorization, and maximum stability settings (120s timeouts, 25 retries, multi-gateway failover).",
  "frontend/.env.example": "Example environment configuration template showing required variables for network setup, canister IDs, Internet Identity URL, stability settings, admin principal, and debug mode with examples for local and mainnet deployment.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and module script loading for the React application root.",
  "frontend/src/App.tsx": "Main application component that orchestrates authentication, actor initialization, user profile setup, and displays landing/dashboard pages with loading states and reinitialization handling.",
  "frontend/src/asset-backend.d.ts": "TypeScript type definitions for the asset backend canister interface, including Asset, UserProfile, UserRole types and all canister method signatures for asset management, access control, and user profiles.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, specifying the service interface with all asset management, administrative, access control, and user profile functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister, defining types and service methods for land management, token claims, loot caches, modifiers, upgrades, and HTTP transformation functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin component for uploading GLB 3D model files to the asset canister with authorization checks, health validation, drag-and-drop support, and progress tracking for valid land types.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with periodic health checks for the asset canister and file upload functionality for GLB models with land type selection and progress tracking.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool component that runs comprehensive tests on the asset canister including actor initialization, network connectivity, authentication, queries, permissions, cycle balance, and inter-canister communication with detailed logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "React component that provides admin UI for reinitializing the Asset Canister, including pre-checks, step-by-step reinitialization process, post-checks, and authorization verification.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Diagnostic tool component that tests canister connectivity across multiple IC gateways, measures response times, determines health status (online/degraded/offline), and provides recommendations with optional auto-refresh.",
  "frontend/src/components/CanisterIDVerification.tsx": "Verification UI component that checks if configured canister IDs match expected values for Land, Cyber Token, Asset, Marketplace, and Governance canisters, displaying status with visual indicators.",
  "frontend/src/components/ConfigValidator.tsx": "Configuration validation component that checks for required environment variables (canister IDs, network settings) and displays prominent error/warning banners with quick-fix instructions when configuration is invalid.",
  "frontend/src/components/CosmicBackground.tsx": "Animated 2D canvas background component that renders a cosmic scene with twinkling stars, pulsing nebulae, and particle effects using optimized 2D context rendering.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders 3D land models based on biome type, with custom FBM shader background, bloom post-processing, and dynamic lighting synchronized to camera position.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Health monitoring dashboard that checks LandCanister and AssetCanister status, displays operational state with icons, and provides manual refresh with query invalidation.",
  "frontend/src/components/Discovery.tsx": "UI for discovering and processing loot caches with tiered costs (CBR tokens + charge), displays cache inventory, and handles discovery/processing mutations with toast notifications.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches component errors and displays a styled error notification with optional custom fallback and error callback.",
  "frontend/src/components/Governance.tsx": "Governance interface with tabs for staking CBR tokens, creating proposals (title/description), and voting on active proposals with weight based on staked balance.",
  "frontend/src/components/LandDashboard.tsx": "Main land management dashboard showing selected land stats, token balance, cooldown timer for reward claims, upgrade/claim actions, modifier inventory, and optional admin debug controls.",
  "frontend/src/components/LandDataDisplay.tsx": "File appears to be empty or contains only whitespace.",
  "frontend/src/components/LandModel.tsx": "React component that loads and renders a 3D GLTF land model using Three.js and react-three-fiber, with KTX2 texture support, PBR material configuration including conditional emissive mapping, biome-specific environment settings, and automatic camera fitting.",
  "frontend/src/components/LandSelector.tsx": "UI component that displays a card with navigation controls to browse through a list of lands, showing the current land's name, biome (in Russian), and position in the collection.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with special styling for the top 3 positions and showing each land's name, upgrade level, and CBR token balance.",
  "frontend/src/components/MapView.tsx": "Interactive map viewer component with pan, zoom, and pinch gestures using react-spring, displaying land coordinates on a background image with biome-colored markers and smooth momentum-based physics.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for buying, selling, and listing lands and modifiers with filtering by type and price range, including dialogs for creating listings and handling transactions with toast notifications.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Network monitoring component that performs periodic health checks against the Asset Canister, displaying connection status, latency metrics, uptime, and consecutive failure counts with expandable diagnostics panel.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas background with moving particles and connecting lines using requestAnimationFrame. Particles bounce within viewport bounds and draw lines when within 150px distance.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI for customizing land plot properties including name (max 20 chars) and decoration URL. Uses React Query mutations to update plot data via backend API.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays a button to connect/disconnect Plug Wallet with dropdown menu showing principal ID and copy/disconnect actions. Shows loading state during connection.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form for new users to create their profile by entering a name. Submits profile data via React Query mutation and shows toast notifications.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay showing connection retry progress with attempt counter, current gateway URL, and animated progress bar. Displays during network reconnection attempts.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React Error Boundary that catches 3D rendering errors and displays fallback UI instead of crashing. Logs errors to console and provides retry button.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration for ICP deployment including canister IDs, asset URLs, model filenames by tier, wallet settings, and feature flags. Provides initialization and validation utilities.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration, managing connection state, principal authentication, and actor creation for Internet Computer canisters.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder game modifiers organized by rarity tiers (1-4), each with id, name, rarity, and asset URL properties.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for governance backend interface including proposals, voting, staking operations, and their result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory definition for governance backend service, specifying all method signatures and data structures for Internet Computer canister communication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook providing automatic actor reinitialization with gateway rotation across multiple IC endpoints, implementing retry logic with progressive delays up to 3 attempts.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization polling logic, validating network connectivity through multiple backend queries with progressive backoff up to 25 attempts over 120 seconds.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and manages an authenticated actor for the Asset Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), health checks, retry logic (25 attempts with exponential backoff), and environment validation. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that monitors Asset Canister health status by polling the /health endpoint with a 1-second delay and 3-second timeout, returning 'checking', 'healthy', or 'error' status.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using Plug wallet authentication, converting files to byte arrays and calling the uploadLandModel method with progress tracking and error handling.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates and manages an authenticated actor for the Governance Canister with automatic gateway failover, 120-second timeout, retry logic (25 attempts), and Internet Identity integration for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity persistence in local storage, delegation validation, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and manages an authenticated actor for the Marketplace Canister with automatic gateway failover (ic0.app primary), 120-second timeout, retry logic (25 attempts), and Internet Identity integration.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query hooks for Plug Wallet transactions across token, marketplace, and governance canisters, including buying/listing items, staking tokens, and voting on proposals with automatic query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for land data, user profiles, token balances, and placeholder types for governance proposals and marketplace listings with mutation handlers for saving profiles and managing transactions.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages an ICP actor for the token canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), retry logic (25 attempts), and 120-second timeout handling.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk-themed dark mode colors (purple-black gradients), Orbitron/JetBrains Mono fonts, glassmorphism effects, and neon glow utilities for cyan/green/purple/yellow text and boxes.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version information for cache busting, providing functions to append version query parameters to URLs and log deployment metadata on app initialization.",
  "frontend/src/lib/debugConfig.ts": "Provides debug logging utilities for 3D scene components with GPU context diagnostics, WebGL renderer detection, canvas overlap detection, and scene stability testing activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File content is truncated; likely handles 3D model loading utilities for Three.js/React Three Fiber components based on project context.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 token handling with 8 decimal places, including formatting balances to human-readable strings, parsing decimal amounts to base units (bigint), adding thousands separators, and checking sufficient balance for transactions.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for marketplace backend canister interface, including Listing type, ItemType enum (Land/Modifier), BuyResult variant, and marketplace methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for marketplace backend service, defining the interface types and methods matching the TypeScript declarations.",
  "frontend/src/pages/Collection.tsx": "Collection page component displaying a catalog of modifiers with tier-based styling (Common, Rare, Legendary, Mythic), showing counts per tier and rendering modifier cards with rarity-specific visual effects.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tab navigation (Land, Discovery, Collection, Leaderboard, Marketplace, Governance, Map), managing land selection and displaying the appropriate view based on active tab and selected land data.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with cosmic/particle backgrounds and Internet Identity login button, handling authentication flow with loading states and error messages.",
  "frontend/src/pages/MintingPage.tsx": "Minting page that displays loading state while initializing land data via actor and queries, showing success message when complete.",
  "frontend/src/pages/VerificationPage.tsx": "Canister configuration verification page with CanisterIDVerification component and cosmic background, providing navigation back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for ICRC-1 token backend canister, including Account, TransferArgs, TransferError/Result types, and methods for balance queries, transfers, minting, and access control.",
  "frontend/src/token-backend.idl.ts": "Candid IDL factory for ICRC-1 token standard, defining types for Account, TransferArgs, TransferError, TransferResult, and MetadataValue, plus service methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for WebGPU API, including GPU adapter/device interfaces, limits, descriptors, and navigator extensions to enable WebGPU feature detection without compilation errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended border radius, neon box shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection, build timestamp for cache busting, dev server proxy to local replica, WASM asset handling, and vendor chunk splitting for React and Three.js.",
  "project_state.json": "Project state tracking document for CyberGenesis Land, recording architectural decisions about dithering, bloom effects, envMap intensity, and emissive pulsing, plus completed feature implementations.",
  "README_RUSSIAN.md": "Russian-language deployment guide covering installation requirements (Node.js 18+, dfx SDK) and quick start instructions for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet deployment script for uploading .glb 3D model assets to AssetCanister on ICP mainnet with rate limiting, base64 encoding, progress tracking, and post-upload verification.",
  "scripts/upload_assets.sh": "Bash script to batch upload 48 tiered 3D model files (tier1-4, 12 models each) to AssetCanister on local dfx replica, with verification and sample URL display.",
  "unknown.txt": "Fragment containing only the text '5. **Test health endpoint:**' with no additional context."
}