{
  "backend/main.mo": "Core LandCanister actor implementing land NFT minting, management, tokenomics with claim/upgrade systems, loot caches, modifications, and access control with authorized admin principal.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for performing a forced full reinstall of Land and Asset Canisters on IC mainnet, including backup procedures and re-initialization steps with documented canister IDs.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis requiring environment configuration with a .env file in the frontend directory.",
  "DEPLOYMENT_GUIDE.md": "Comprehensive mainnet deployment guide covering prerequisites, deployment sequence for all five canisters, and 3D model asset setup with dfx CLI instructions.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration instructions for deploying all five canisters in the correct order.",
  "DEVELOPER_README.md": "Complete developer documentation covering the multi-canister architecture (LandCanister, CyberTokenCanister, MarketplaceCanister, GovernanceCanister, AssetCanister), inter-canister communication, and project status as audit-ready.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide for critical environment variables required in frontend/.env, including network configuration settings.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister ID and canister availability errors through proper environment variable configuration and backend canister deployment.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence map configuration features for MapView.tsx: Golden Archive projection setup, ImageLayer webp configuration, and cinematic drone entry animation parameters.",
  "frontend-file-summaries.txt": "Detailed summaries of all frontend components including MapView with Maptalks.js Golden Archive configuration, Dashboard with conditional mounting, 3D visualization components, and Russian language UI throughout.",
  "frontend/.env": "Production environment configuration permanently set to IC mainnet with all five canister IDs, admin authorization principal, network stability settings (120s timeouts, 25 retries), and multi-gateway failover configuration.",
  "frontend/.env.example": "Environment variables template with network configuration, all five canister IDs, Internet Identity URL, stability settings, admin principal, and debug mode flag with examples for local and mainnet deployment.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and root div mounting the React application from main.tsx.",
  "frontend/src/App.tsx": "Main application component that manages authentication flow, actor initialization, profile setup, and displays landing/dashboard pages with cosmic/particle backgrounds and reinitialization progress handling.",
  "frontend/src/asset-backend.d.ts": "TypeScript type definitions for the asset backend canister interface, including Asset, UserProfile, UserRole types and all asset management, admin, and user profile methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, specifying service methods for asset management, access control, user profiles, and administrative functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister, defining types and service methods for land management, token claims, loot caches, modifiers, upgrades, and HTTP transformations.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin component for uploading GLB 3D models to specific land types with authorization checks, asset canister health verification, file validation, and progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with asset canister health monitoring, land type selection, GLB file upload interface with validation, and periodic health checks every 30 seconds.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Comprehensive diagnostics tool that runs 8 tests on asset canister health including actor initialization, network connectivity, authentication, queries, permissions, cycle balance, and inter-canister communication with detailed logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "React component for reinitializing the Asset Canister with admin authorization checks, pre/post health checks, and a multi-step reinitialization process with status tracking.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Diagnostic tool that tests canister connectivity across multiple IC gateways, measures response times, and generates health reports with recommendations for Land and Asset canisters.",
  "frontend/src/components/CanisterIDVerification.tsx": "UI component that verifies and displays the correctness of configured canister IDs (Land, Cyber Token, Asset, Marketplace, Governance) against expected values from environment variables.",
  "frontend/src/components/ConfigValidator.tsx": "Validation component that checks for required environment variables (canister IDs, network config) and displays critical errors or warnings in a prominent banner with quick-fix instructions.",
  "frontend/src/components/CosmicBackground.tsx": "Animated 2D canvas background rendering a cosmic scene with twinkling stars and pulsing nebulae using non-WebGL rendering for visual atmosphere.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders a 3D scene with biome-specific GLTF models, dynamic lighting, bloom post-processing, and an animated FBM shader background sphere with neon colors.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Health monitoring dashboard that checks LandCanister and AssetCanister status, displays operational state with icons, and provides manual refresh functionality with toast notifications.",
  "frontend/src/components/Discovery.tsx": "UI for discovering and processing loot caches with tiered costs (CBR tokens and charge), displays cache inventory, and handles discovery/processing mutations with error handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches component errors and displays a styled error notification with optional custom fallback and error callback.",
  "frontend/src/components/Governance.tsx": "Governance interface for staking CBR tokens, creating proposals, and voting on active proposals with validation, mutation handling, and formatted balance displays.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard for managing land plots with reward claiming (24h cooldown timer), plot upgrades, modifier application, and admin debug tools for token balances.",
  "frontend/src/components/LandDataDisplay.tsx": "File appears to be empty or contains only whitespace.",
  "frontend/src/components/LandModel.tsx": "React Three Fiber component that loads and renders GLTF land models with KTX2 texture support, applying biome-specific lighting configurations, PBR materials with emissive maps, anisotropic filtering, and dynamic camera fitting with pulsing emissive effects.",
  "frontend/src/components/LandSelector.tsx": "UI component for navigating between owned land plots with previous/next buttons, displaying the current land's name, biome type in Russian, and position in the collection.",
  "frontend/src/components/Leaderboard.tsx": "Displays the top 10 land plots ranked by token balance with special styling for top 3 positions, showing plot name, upgrade level, and CBR token balance.",
  "frontend/src/components/MapView.tsx": "Interactive map component using Maptalks.js library loaded via CDN, displaying all land plots with biome-colored markers, custom projections, and user-owned land highlighting.",
  "frontend/src/components/Marketplace.tsx": "Marketplace interface for buying, selling, and listing land plots and modifiers with filtering by type and price, displaying active listings and managing user's own listings with cancel functionality.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Network monitoring component that performs periodic health checks against the Asset Canister, displaying connection status, latency metrics, uptime, and consecutive failure counts with expandable diagnostics panel.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas background with moving particles and connecting lines using requestAnimationFrame. Handles window resize and cleanup of animation frames on unmount.",
  "frontend/src/components/PlotCustomization.tsx": "Provides a UI card for customizing land plot names (max 20 chars) and decoration URLs. Uses React Query mutations to update plot data and displays loading states during updates.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays a wallet connection button that shows truncated principal ID when connected and provides a dropdown menu for copying the full principal or disconnecting. Handles connecting/disconnecting states with loading indicators.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a profile setup form for new users to enter their name and create a profile. Uses React Query mutation to save the profile and displays toast notifications for success/error states.",
  "frontend/src/components/ReinitializationProgress.tsx": "Displays a full-screen modal showing connection reinitialization progress with attempt count, current gateway, and animated progress bar. Used during network reconnection attempts.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React error boundary that catches and logs 3D rendering errors without crashing the canvas. Displays a fallback UI with error details and a retry button when errors occur.",
  "frontend/src/config/mainnet.ts": "Defines mainnet configuration for ICP deployment including canister IDs, asset URLs, model filenames by tier, and feature flags. Provides initialization and validation functions for the mainnet setup.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration, managing connection state, principal authentication, and actor creation for Internet Computer canisters.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder game modifiers organized by rarity tiers (1-4), each with id, name, rarity, and asset URL properties.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for governance backend interface including proposals, voting, staking operations, and their result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory definition for governance backend service, specifying all method signatures and data structures for Internet Computer canister communication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook providing automatic actor reinitialization with gateway rotation across multiple IC endpoints, implementing retry logic with progressive delays up to 3 attempts.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization polling logic, validating backend connectivity through multiple health checks with progressive backoff up to 25 retries.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and manages an authenticated Actor for the Asset Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), health checks, retry logic (25 attempts with exponential backoff), and environment validation. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that monitors Asset Canister health by fetching the /health endpoint with a 1-second delay and 3-second timeout, returning status as 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using Plug wallet authentication. Reads files as ArrayBuffer, converts to byte array, and calls uploadLandModel with progress tracking.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates and manages an authenticated Actor for the Governance Canister with automatic gateway failover, 120-second timeout, and retry logic (25 attempts). Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence in local storage, delegation validation, and configurable AuthClient options with idle handling.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and manages an authenticated Actor for the Marketplace Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), 120-second timeout, and retry logic (25 attempts). Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query hooks for Plug Wallet transactions across token, marketplace, and governance canisters, including buying/listing items, staking tokens, and voting on proposals with automatic query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for land data, user profiles, token balances, and placeholder types for governance proposals and marketplace listings with retry logic and error handling.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a token canister actor with automatic gateway failover across multiple IC endpoints, retry logic (up to 25 attempts), and 120-second timeout handling for both local and mainnet environments.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk-themed dark mode colors, Orbitron/JetBrains Mono fonts, glassmorphism effects, and neon glow utilities for cyan, green, purple, and yellow text/box shadows.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version information for cache busting, providing functions to append version query parameters to URLs and log deployment metadata on app initialization.",
  "frontend/src/lib/debugConfig.ts": "Provides debug logging utilities for 3D scene components with GPU context diagnostics, WebGL renderer detection, canvas overlap detection, and scene stability testing activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File content is truncated; likely handles 3D model loading utilities for Three.js/R3F components based on project context.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 token handling with 8 decimal places, including formatting balances to human-readable strings, parsing decimal amounts to base units (bigint), adding thousands separators, and checking sufficient balance for transactions.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for marketplace backend canister interface, including Listing type, ItemType enum (Land/Modifier), BuyResult variant, and marketplace methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for marketplace backend service, defining the interface types and methods for marketplace operations.",
  "frontend/src/pages/Collection.tsx": "Collection page component displaying a catalog of modifiers with tier-based styling (Common, Rare, Legendary, Mythic), showing counts per tier and rendering modifier cards with rarity-specific visual effects.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tabbed navigation (Land, Discovery, Collection, Leaderboard, Marketplace, Governance, Map) that manages land selection and displays the appropriate view based on active tab.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with cosmic/particle backgrounds that prompts users to connect via Internet Identity, displaying login status and error messages with animated visual effects.",
  "frontend/src/pages/MintingPage.tsx": "Minting page that shows loading state while initializing land data and actor, displaying success message once complete.",
  "frontend/src/pages/VerificationPage.tsx": "Verification page for checking canister ID configuration with CanisterIDVerification component and navigation back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for ICRC-1 token backend canister, including Account, TransferArgs, TransferError/Result types, and methods for balance queries, transfers, minting, and access control.",
  "frontend/src/token-backend.idl.ts": "Candid IDL factory defining ICRC-1 token interface with Account, TransferArgs, TransferError types and methods for balance_of, transfer, metadata, total_supply, and mint operations.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for WebGPU API including GPU, GPUAdapter, GPUDevice, GPUQueue interfaces and related types for WebGPU feature detection and usage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom shadows including neon effects, and accordion animations.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, environment variable injection, build timestamp for cache busting, proxy setup for local API, COOP/COEP headers, and special handling for WASM/basis_transcoder assets.",
  "project_state.json": "Project state document describing a 3D map viewer with Maptalks identity projection, drone-like kinetic physics, cinematic camera controls, and detailed configuration for coordinate system, viewport, and UI markers.",
  "README_RUSSIAN.md": "Russian-language deployment guide providing overview, requirements, and quick start instructions for the CyberGenesis DApp.",
  "scripts/upload_assets_mainnet.sh": "Bash script that uploads all .glb 3D model files from ./assets/models to the AssetCanister on ICP mainnet with rate limiting and verification. Provides stable URLs in format https://[canister-id].raw.ic0.app/[filename].glb for production use.",
  "scripts/upload_assets.sh": "Bash script for batch uploading 48 3D model files (12 per tier across 4 tiers) to AssetCanister, with base64 encoding, verification, and URL generation for uploaded assets.",
  "unknown.txt": "Fragment containing only a numbered list item '5. **Test health endpoint:**' with no additional context or content."
}