{
  "backend/main.mo": "Motoko backend canister implementing land minting logic, user profiles, loot caches, modifiers, and various game-related data structures.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for fully reinstalling Land and Asset canisters on mainnet and performing complete re-initialization with required admin and canister IDs.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist outlining required environment setup and `.env` configuration for the CyberGenesis frontend.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide describing prerequisites and the full sequence for deploying the Land Mint DApp and associated canisters.",
  "DEPLOYMENT_INSTRUCTIONS.md": "High-level deployment instructions emphasizing environment configuration and correct canister deployment order.",
  "DEVELOPER_README.md": "Developer documentation describing CyberGenesis architecture, canister roles, and system interactions for the multi-canister DApp.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing required environment variables for the frontend `.env` file, focusing on network settings and canister IDs.",
  "ENVIRONMENT_SETUP.md": "Setup guide for configuring environment variables and deploying backend canisters to fix missing or misconfigured asset canister issues.",
  "feature_evidence.json": "Feature evidence report documenting implemented frontend background shader features and configuration requirements for CubeVisualization.tsx.",
  "frontend-file-summaries.txt": "Collection of frontend file summaries detailing component purposes, UI behavior, animation systems, and 3D scene configuration.",
  "frontend/.env": "Production environment configuration for IC mainnet specifying all required canister IDs, network settings, and stability-related parameters.",
  "frontend/.env.example": "Template `.env` file showing required environment variables for network configuration, canister IDs, debugging, and admin authorization.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx with no-cache directives.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, profile setup flow, and reinitialization UI states.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister including assets, profiles, roles, and all service methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory defining the asset backend canister interface for asset operations, admin controls, and user profiles.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister defining land data, modifiers, rewards, loot, profiles, and administrative methods.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only GLB model upload component with authorization checks, canister health verification, and upload management UI.",
  "frontend/src/components/AdminPanel.tsx": "Simplified admin panel handling GLB uploads with health checks, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostics tool running tests on asset and land canisters, logging results, and checking actor state and connectivity.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Admin-only tool that checks, reinitializes, and validates the health of the Asset Canister with step-based status tracking.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs multi-gateway health checks for Land and Asset canisters, measuring response times and generating status reports and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays whether environment variables for canister IDs match known correct IDs and highlights mismatches.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and shows a blocking error banner when configuration is incomplete.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D starfield and nebula background using canvas with optimized drawing and resize handling.",
  "frontend/src/components/CubeVisualization.tsx": "Implements a 3D biome viewer using React Three Fiber with custom lighting, sky shader, bloom effects, and biome-specific model loading.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all rendering logic was moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks health of Land and Asset canisters, shows status, and refreshes periodically with UI indicators and toast messages.",
  "frontend/src/components/Discovery.tsx": "Handles loot cache discovery and processing, including cost checks, balance validation, and interaction with canister actor methods.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that logs caught errors and displays a styled fallback UI.",
  "frontend/src/components/Governance.tsx": "Provides staking, proposal creation, and voting UI backed by query hooks and mutation calls with validation and toasts.",
  "frontend/src/components/LandDashboard.tsx": "Displays land stats, rewards, cooldowns, upgrades, modifiers, and admin tools while syncing with canister data via hooks.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implemented logic.",
  "frontend/src/components/LandModel.tsx": "Loads and renders a GLTF land model with KTX2 textures, applies biome‑based PBR material tweaks, and auto‑fits the camera to the model.",
  "frontend/src/components/LandSelector.tsx": "Displays land details with biome names and navigation buttons to switch between available lands.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays the top 10 lands with rank styling, token balances, and loading/error handling.",
  "frontend/src/components/MapView.tsx": "Renders an interactive map with drag, zoom, and pinch gestures, centering on the user’s land and drawing biome-colored markers.",
  "frontend/src/components/Marketplace.tsx": "Implements a marketplace for lands and modifiers with filters, buying, listing, and cancellation logic.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Performs periodic health checks against the asset canister, tracks latency and connection status, and displays real‑time diagnostics.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas with bouncing particles and connecting lines, handling resize and cleanup.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI to edit a land plot's name and decoration URL, syncing with backend mutations.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays a Plug wallet connect button or a dropdown with principal info and disconnect actions.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile by submitting a name with validation and mutation handling.",
  "frontend/src/components/ReinitializationProgress.tsx": "Shows a full‑screen overlay indicating connection reinitialization progress and gateway rotation.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and shows a fallback UI with reset capability.",
  "frontend/src/config/mainnet.ts": "Defines mainnet config, canister IDs, model URLs, and validation utilities for production deployment.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides a React context for detecting, connecting, disconnecting, and using the Plug wallet, including actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Defines a static placeholder catalog of modifiers with IDs, names, rarity tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "TypeScript definitions for governance backend interfaces, proposals, votes, and result variants.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory defining the governance backend service, records, and variant types.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook that retries actor creation across multiple gateways with delays and user notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "Extended actor hook that tracks initialization, polls backend readiness, and provides status and error state.",
  "frontend/src/hooks/useAssetActor.ts": "Validates env vars and builds an asset canister actor with gateway health checks and retry logic.",
  "frontend/src/hooks/useAssetHealth.ts": "Performs a delayed one-time health check on the asset canister and returns a simple health status.",
  "frontend/src/hooks/useAssetUpload.ts": "Uploads GLB files to the asset canister using Plug wallet, tracking progress and errors.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes a governance canister actor with Internet Identity, retry logic, and gateway failover.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for logging in with Internet Identity and managing identity state.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes a marketplace canister actor with Internet Identity, retry handling, and gateway selection.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Defines generic and specific React Query mutation hooks for executing token, marketplace, and governance canister transactions via the Plug Wallet.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating land data, user profiles, token balances, and placeholder governance/marketplace types.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes and retries creation of a token canister actor with automatic gateway selection and timeout handling.",
  "frontend/src/index.css": "Global Tailwind-based styling defining dark theme variables, fonts, neon effects, and glassmorphism UI elements.",
  "frontend/src/lib/buildInfo.ts": "Generates build metadata, provides cache‑busting utilities, and logs build details during app startup.",
  "frontend/src/lib/debugConfig.ts": "Implements 3D debugging utilities including logging, GPU diagnostics, renderer detection, and scene stability checks.",
  "frontend/src/lib/modelLoader.ts": "Empty file or placeholder for future model‑loading utilities.",
  "frontend/src/lib/tokenUtils.ts": "Provides helpers to format and parse token amounts with fixed decimals and optional separators, plus balance checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "Type definitions for marketplace canister interactions including listings, item types, and buy results.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL for the marketplace canister defining item types, listing records, buy results, and service methods.",
  "frontend/src/pages/Collection.tsx": "Renders a modifier collection view with rarity tiers, counts, and styled cards.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard handling land data loading, tab navigation, and rendering feature components.",
  "frontend/src/pages/LandingPage.tsx": "Login page using Internet Identity with animated UI and error handling.",
  "frontend/src/pages/MintingPage.tsx": "Displays land initialization status and loading indicators before redirecting.",
  "frontend/src/pages/VerificationPage.tsx": "Shows canister ID verification UI with background effects and navigation link.",
  "frontend/src/token-backend.d.ts": "Type definitions for token canister ICRC-1 operations, transfer errors, metadata, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines Candid IDL types and service methods for token operations including balance, transfer, metadata, supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript declarations for WebGPU interfaces to enable API usage without type errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, animations, container settings, and plugin setup.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, asset handling (including WASM), build timestamping, and dev server proxying.",
  "project_state.json": "Stores project metadata, feature requirements, shader‑background goals, and pending requests for a Three.js gradient background.",
  "README_RUSSIAN.md": "Russian-language deployment guide providing project overview, requirements, and quick-start instructions.",
  "scripts/upload_assets_mainnet.sh": "Mainnet‑focused script to upload .glb assets to the AssetCanister with rate limiting and verification.",
  "scripts/upload_assets.sh": "Local script to batch‑upload tiered 3D model assets to an AssetCanister using dfx.",
  "unknown.txt": "Contains a fragment referencing testing a health endpoint."
}