{
  "backend/main.mo": "Motoko actor implementing core land-minting logic, data types, access control, and registries for land, profiles, loot, and modifiers.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for performing a forced reinstall of Land and Asset canisters on mainnet, including prerequisites and required canister IDs.",
  "DEPLOYMENT_CHECKLIST.md": "High‑level deployment checklist outlining environment setup steps before launching CyberGenesis.",
  "DEPLOYMENT_GUIDE.md": "Step‑by‑step guide for deploying the full CyberGenesis Land Mint DApp to IC mainnet, including prerequisites and asset requirements.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief deployment instructions emphasizing correct order of deploying all five canisters.",
  "DEVELOPER_README.md": "Developer documentation describing CyberGenesis architecture, canister roles, and system overview.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing required frontend environment variables and network configuration details.",
  "ENVIRONMENT_SETUP.md": "Setup guide for configuring environment variables and deploying backend canisters to resolve configuration errors.",
  "feature_evidence.json": "Feature evidence report listing diagnostic 3D scene updates applied to CubeVisualization.tsx with associated test IDs.",
  "frontend-file-summaries.txt": "Text file summarizing the purpose and behavior of all key frontend components and pages.",
  "frontend/.env": "Mainnet environment configuration defining canister IDs, network settings, stability parameters, and admin principal.",
  "frontend/.env.example": "Example environment template showing required variables for local and mainnet setups.",
  "frontend/index.html": "Base HTML entrypoint loading the Vite-built React app with caching disabled.",
  "frontend/src/App.tsx": "Main app component handling identity initialization, actor setup, user profile detection, and conditional rendering of loading, reinitialization, profile setup, landing, or dashboard views.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister including asset types, user roles, profiles, and all available backend methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory defining the asset backend service interface for asset management, admin functions, access control, and user profiles.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister including land data, rewards, loot, modifiers, upgrades, user profiles, and system queries.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only GLB model upload UI that validates authorization, checks canister health, and manages drag-and-drop upload flow with progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for uploading GLB files with health checks, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool running multiple tests on asset and land canisters, logging results, checking permissions, connectivity, and cycle balance.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Admin-only tool that runs pre-checks and post-checks and executes a multi‑step asset canister reinitialization workflow. Manages authorization state, step tracking, and health validation of asset and land canisters.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Performs periodic health checks of land and asset canisters across multiple IC gateways. Measures response times, determines overall status, and generates recommendations based on gateway test results.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays whether environment variable canister IDs match known correct IDs. Shows per‑canister status and highlights mismatches for configuration debugging.",
  "frontend/src/components/ConfigValidator.tsx": "Validates critical environment variables at runtime and displays an error banner if required config values are missing. Lists errors, warnings, and suggested fixes for incorrect setup.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D canvas starfield and nebula background with twinkling and pulsing effects. Handles window resizing and manages animation via requestAnimationFrame.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a Three.js scene with biome-based models, diagnostic lighting, background sphere, fog, and bloom effects.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file exporting nothing; all logic moved elsewhere.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks canister health for Land and Asset canisters, showing status, errors, and refresh controls.",
  "frontend/src/components/Discovery.tsx": "Handles loot cache discovery and processing, checking balances, calling actor methods, and updating cached data.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary that captures component errors and shows a styled fallback alert.",
  "frontend/src/components/Governance.tsx": "Provides UI for staking tokens, creating proposals, and voting on active proposals with backend interactions.",
  "frontend/src/components/LandDashboard.tsx": "Displays land stats, cooldown timers, rewards, upgrades, and modifier application with admin debug options.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implementation.",
  "frontend/src/components/LandModel.tsx": "Loads a GLTF land model with KTX2 textures, applies biome-based PBR tweaks, and auto-fits the camera to the model.",
  "frontend/src/components/LandSelector.tsx": "Displays land info with biome labels and navigation buttons to switch between available lands.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and shows a top‑10 land leaderboard with loading and error states.",
  "frontend/src/components/MapView.tsx": "Renders a pannable and zoomable world map with gesture controls and positioning based on user land coordinates.",
  "frontend/src/components/Marketplace.tsx": "Implements a marketplace UI for viewing, filtering, buying, and listing land and modifier items.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Performs periodic health checks to an asset canister and displays connection status, latency, and uptime.",
  "frontend/src/components/ParticleBackground.tsx": "Canvas-based particle animation with interactive movement, connections, and resize handling.",
  "frontend/src/components/PlotCustomization.tsx": "UI for editing a land plot's name and decoration URL using mutation hooks.",
  "frontend/src/components/PlugWalletButton.tsx": "Connect/disconnect button for Plug Wallet with dropdown for copy and logout actions.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing the user to submit and save their display name.",
  "frontend/src/components/ReinitializationProgress.tsx": "Fullscreen overlay showing connection retry progress, gateway info, and attempt counter.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and shows a fallback UI with reset option.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration for canister IDs, asset URLs, feature flags, wallet settings, and helpers.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides React context for Plug Wallet handling connection, principal state, and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Contains a static list of placeholder modifier items grouped by rarity tiers for UI use.",
  "frontend/src/governance-backend.d.ts": "Defines TypeScript interfaces and result types for the governance backend service.",
  "frontend/src/governance-backend.idl.ts": "Provides Candid IDL definitions for proposals, voting, staking, and governance service methods.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Implements automatic actor reinitialization with retry logic and gateway rotation on connection failures.",
  "frontend/src/hooks/useActorWithInit.ts": "Wraps useActor with additional initialization, polling, and connectivity validation logic.",
  "frontend/src/hooks/useAssetActor.ts": "Handles environment validation, gateway health checks, and creation of an asset canister actor with retries and failover.",
  "frontend/src/hooks/useAssetHealth.ts": "Provides a hook that performs a delayed health check on the asset canister and returns its health status.",
  "frontend/src/hooks/useAssetUpload.ts": "Implements GLB file upload to the asset canister using Plug wallet authentication and progress tracking.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes the governance canister actor with identity, retries, and gateway selection for failover.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes the marketplace canister actor with identity, retries, and gateway failover logic.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Defines reusable Plug Wallet transaction hook and marketplace/governance-specific mutation hooks with query invalidation and error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for land data, user profiles, token balances, and placeholder types for marketplace/governance operations.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes the token canister actor with retry logic, gateway selection, and identity integration for Internet Identity sessions.",
  "frontend/src/index.css": "Sets global styles, Tailwind layers, fonts, and neon-themed UI effects for the application.",
  "frontend/src/lib/buildInfo.ts": "Exposes build timestamp/version info and utilities for cache busting and build logging.",
  "frontend/src/lib/debugConfig.ts": "Implements 3D scene debugging utilities, including logs, GPU diagnostics, renderer detection, and performance helpers.",
  "frontend/src/lib/modelLoader.ts": "Empty placeholder file for model loading functionality.",
  "frontend/src/lib/tokenUtils.ts": "Provides utilities to format and parse ICRC‑1 token amounts, including decimal handling and formatted output with separators.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript definitions for the marketplace canister, including item types, listing structures, and buy results.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory describing the marketplace canister’s service, records, and variants.",
  "frontend/src/pages/Collection.tsx": "Renders the modifier collection page with rarity tiers, counts, and styled cards.",
  "frontend/src/pages/Dashboard.tsx": "Main user dashboard managing tabs, land data fetching, and rendering different feature views.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login flow, animated visuals, and error handling.",
  "frontend/src/pages/MintingPage.tsx": "Shows land‑minting initialization status and transitions toward the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Displays a canister ID verification tool with themed background and return link.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for the token canister, including accounts, transfers, metadata, and admin functions.",
  "frontend/src/token-backend.idl.ts": "Defines Candid IDL types and service interface for token operations including balance, transfer, metadata, supply, and mint.",
  "frontend/src/types/webgpu.d.ts": "TypeScript declarations enabling WebGPU API usage and feature detection without compiler errors.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and persisting or clearing them across navigation.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, containers, and plugins for the frontend.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, asset handling (including WASM), custom build filenames, and dev server setup.",
  "project_state.json": "Tracks project metadata, diagnostic rendering tasks, feature requests, and known issues for the 3D background debug work.",
  "README_RUSSIAN.md": "Russian-language deployment overview and quick‑start instructions for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet batch uploader for .glb assets that handles canister lookup, rate limiting, upload verification, and summary output.",
  "scripts/upload_assets.sh": "Local script that batch‑uploads tiered .glb models to an AssetCanister using dfx and verifies uploaded assets.",
  "unknown.txt": "Contains a brief note referencing a health‑endpoint test."
}