{
  "backend/main.mo": "Core LandCanister Motoko implementation defining land data types, user structures, modifiers, loot caches, and initial access control state.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for performing a forced reinstall and re-initialization of Land and Asset canisters on IC mainnet, including prerequisites and backup steps.",
  "DEPLOYMENT_CHECKLIST.md": "High-level checklist covering environment setup and required frontend .env variables for deployment.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide detailing requirements and the sequence for creating and deploying all canisters and 3D assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief instructions outlining critical environment setup and the required order for deploying all canisters.",
  "DEVELOPER_README.md": "Developer documentation describing system architecture, canister responsibilities, and project overview for the CyberGenesis DApp.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing required frontend environment variables and network configuration settings.",
  "ENVIRONMENT_SETUP.md": "Setup guide explaining environment configuration and backend canister deployment to resolve common initialization errors.",
  "feature_evidence.json": "Feature evidence report describing a shader update in CubeVisualization.tsx and its associated components and tests.",
  "frontend-file-summaries.txt": "JSON-like list summarizing key frontend files, including component behaviors, UI styling, and rendering logic.",
  "frontend/.env": "Production environment configuration for IC mainnet containing required canister IDs, admin principal, and stability settings.",
  "frontend/.env.example": "Template environment file showing required variables, canister IDs, and optional debug settings for local or mainnet use.",
  "frontend/index.html": "Base HTML entrypoint loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling identity, actor initialization, profile setup flow, and system initialization UI with backgrounds.",
  "frontend/src/asset-backend.d.ts": "Type definitions for asset backend, including asset data structures, user roles, and available canister methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL service definition for the asset canister with upload, query, admin, and profile functions.",
  "frontend/src/backend.idl.ts": "Candid IDL for the main backend canister defining land data, rewards, modifiers, upgrades, HTTP transforms, and user role functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "React component for authorized admins to upload GLB models with health checks, drag-and-drop, and progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Simplified admin UI for uploading GLB files with periodic health checks and basic validation.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Runs detailed diagnostics on the asset canister including connectivity, permissions, cycle balance, and logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Provides admin-only canister reinitialization workflow with pre-checks, post-checks, and authorization verification.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs connectivity tests against IC gateways for canisters, aggregates health reports, and displays status with auto-refresh.",
  "frontend/src/components/CanisterIDVerification.tsx": "Checks environment variables for expected canister IDs and displays correctness indicators for each.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and renders a warning banner when configuration errors are detected.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D canvas background with stars and nebula effects using optimized drawing loops.",
  "frontend/src/components/CubeVisualization.tsx": "Displays biome-based 3D land models with lighting, shaders, and postprocessing using React Three Fiber.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file noting all 3D logic was moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks health of two canisters using actors, updates status periodically, and displays state with icons and refresh controls.",
  "frontend/src/components/Discovery.tsx": "Manages discovering and processing loot caches, handling token costs, land charge, and updating queries after actions.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches render errors and displays a styled fallback or custom fallback.",
  "frontend/src/components/Governance.tsx": "Implements token staking, proposal creation, and voting with validation, mutation calls, and toast feedback.",
  "frontend/src/components/LandDashboard.tsx": "Displays selected land info, claim cooldowns, token balances, and handles reward claiming, upgrades, and modifier application.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty placeholder component file.",
  "frontend/src/components/LandModel.tsx": "Loads and configures a GLTF land model with KTX2 textures, biome-based emissive effects, and material adjustments for rendering.",
  "frontend/src/components/LandSelector.tsx": "Carousel-like selector for navigating lands, showing plot name, biome label, and index with prev/next buttons.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays a top-10 ranked lands list with loading and error states, showing plot info and token balance.",
  "frontend/src/components/MapView.tsx": "Interactive canvas map with panning, zooming, gesture handling, and continuous rendering, centering on the user's land.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for viewing, filtering, buying, listing, and canceling land and modifier items with dialogs and mutations.",
  "frontend/src/components/MatrixAnimation.tsx": "File is empty or missing implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Runs periodic asset-canister health checks, tracking connectivity, latency, failures, and displaying network status.",
  "frontend/src/components/ParticleBackground.tsx": "Animated 2D canvas particle system with drifting particles and connecting lines as a visual background.",
  "frontend/src/components/PlotCustomization.tsx": "UI for editing a land plot's name and decoration URL using update mutations. Loads selected land data and provides input fields with validation and update buttons.",
  "frontend/src/components/PlugWalletButton.tsx": "Connect/disconnect button for Plug Wallet with dropdown showing principal and actions. Handles connecting, copying principal, and logout.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile by entering a name and saving via mutation. Shows success and error toasts.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full‑screen overlay showing reconnection attempts, gateway info, and progress indicator. Used during automatic network reinitialization.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and displays a fallback UI. Provides reset functionality and logs detailed error info.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration for canister IDs, asset URLs, model filenames, wallet settings, and validation. Includes helpers to initialize config and generate model URLs.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Context managing Plug Wallet connection state, principal, actor creation, and connect/disconnect logic. Provides UI notifications and checks for plugin availability.",
  "frontend/src/data/modifierCatalog.ts": "Defines a placeholder static catalog of planned modifiers with IDs, names, tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "TypeScript definitions for governance canister data models and interface methods including proposals, voting, and staking.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory describing the governance canister’s service methods and data record/variant structures.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and caches a backend actor, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorReinitializer.ts": "Provides automatic multi-gateway actor reinitialization with retries, delays, status tracking, and user notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "Wraps useActor with additional initialization, timeout handling, and multi-step connectivity polling to ensure backend readiness.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and maintains an asset canister actor with environment validation, multi-gateway failover, health checks, and retry logic.",
  "frontend/src/hooks/useAssetHealth.ts": "Simple hook performing a delayed health check against the asset canister and returning its health status.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to an asset canister using Plug Wallet, handling authorization, file reading, progress, and errors.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes and retries creation of a governance canister actor with Internet Identity and gateway failover.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and helpers for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes and retries creation of a marketplace canister actor with Internet Identity and gateway failover.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Defines reusable Plug Wallet transaction hooks for token, marketplace, and governance canisters with react‑query.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for land data, profiles, token balance, governance, and marketplace operations.",
  "frontend/src/hooks/useTokenActor.ts": "React hook that initializes and retries creation of a token canister actor with gateway failover and timeout handling.",
  "frontend/src/index.css": "Tailwind-based global styles defining dark theme variables, fonts, neon effects, and glassmorphism UI utilities.",
  "frontend/src/lib/buildInfo.ts": "Generates build metadata, provides cache‑busting URL utility, and logs build info on startup.",
  "frontend/src/lib/debugConfig.ts": "Debug module for 3D features offering logging, GPU diagnostics, renderer detection, and performance tools.",
  "frontend/src/lib/modelLoader.ts": "Empty module placeholder for model loading functionality.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for formatting and parsing ICRC‑1 token amounts with decimal handling and separators.",
  "frontend/src/main.tsx": "Application entry point mounting React, initializing QueryClient, and providing Internet Identity context.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript definitions for the marketplace canister including ItemType, Listing, BuyResult, and interface methods.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory defining the marketplace service, record types, and variant result for buy operations.",
  "frontend/src/pages/Collection.tsx": "Renders a modifier collection page with tier-based styling and counts from the modifier catalog.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing land data and multiple tabs, using React Query and actor-based data fetching.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling Internet Identity login with animated UI feedback and error handling.",
  "frontend/src/pages/MintingPage.tsx": "Displays loading state for land initialization and confirms setup before redirecting to the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Page for validating project canister IDs with a verification component and styled background.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for token backend interfaces, including transfers, metadata, and admin controls.",
  "frontend/src/token-backend.idl.ts": "IDL factory defining service methods and types for interacting with the token canister.",
  "frontend/src/types/webgpu.d.ts": "Type declarations enabling WebGPU API usage and detection in TypeScript without errors.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear them, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, shadows, and container settings with plugins and custom design tokens.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable prefixes, build timestamping, WASM asset support, aliases, and dev server proxying.",
  "project_state.json": "JSON state describing shader-fix requirements, known issues, and pending feature requests for the background sphere rendering.",
  "README_RUSSIAN.md": "Russian-language deployment overview with requirements and quick start steps for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet upload script for .glb assets that handles base64 conversion, rate limiting, verification, and canister ID resolution.",
  "scripts/upload_assets.sh": "Local network script that uploads tiered .glb model files to the AssetCanister using dfx and verifies uploaded assets.",
  "unknown.txt": "Contains a single line referencing testing a health endpoint."
}