{
  "backend/main.mo": "Primary backend canister implementing land minting logic, data structures, access control, and gameplay mechanics.",
  "CANISTER_REINSTALL_GUIDE.md": "Guide for performing a forced full reinstall and re-initialization of Land and Asset canisters with prerequisites and backup steps.",
  "DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining environment configuration steps for preparing the CyberGenesis system.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide detailing prerequisites and the sequence for creating and deploying all canisters and assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "High-level deployment instructions covering critical environment setup and ordered canister deployment.",
  "DEVELOPER_README.md": "Developer documentation describing system architecture, canister responsibilities, and inter-canister communication.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide listing required frontend environment variables and network configuration settings.",
  "ENVIRONMENT_SETUP.md": "Setup guide explaining environment configuration and backend canister deployment for resolving common errors.",
  "feature_evidence.json": "Feature evidence report documenting two frontend feature updates with associated files and test references.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of various frontend source files.",
  "frontend/.env": "Main production environment configuration containing canister IDs, network settings, and admin authorization.",
  "frontend/.env.example": "Template environment file providing required variables and example configurations for local and mainnet use.",
  "frontend/index.html": "Base HTML entry point loading the root application and Vite main script with cache prevention headers.",
  "frontend/src/App.tsx": "Main app component handling identity initialization, actor setup, profile loading, and conditional rendering for loading, reinitialization, and authenticated pages.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister including assets, user profiles, roles, and all asset‑related API methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL describing the asset canister’s asset management, admin controls, access control, and user profile endpoints.",
  "frontend/src/backend.idl.ts": "Candid IDL defining the main backend service for lands, rewards, modifiers, user roles, HTTP transforms, and game logic operations.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin‑only GLB model upload tool with health checks, authorization validation, drag‑and‑drop, and upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Simple admin panel for GLB uploads including canister health checks, file validation, and simulated upload flow.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool running multiple tests against the asset canister, logging results, checking permissions, and querying cycle balance and inventory.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Provides an admin-only UI workflow to run pre-checks, reinitialize the asset canister, and perform post-checks with step tracking and status toasts.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs connectivity and health tests against land and asset canisters across multiple gateways, generating status reports and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays whether environment variables match expected canister IDs and highlights mismatches in a visual card layout.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and shows a fixed error banner with detailed issues and quick-fix instructions if misconfigured.",
  "frontend/src/components/CosmicBackground.tsx": "Renders a full-screen animated 2D canvas starfield and nebula background with twinkling and pulsing effects for visual ambiance.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a biome‑based 3D scene using three.js, custom shaders, lighting sync, and dynamic background effects.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file exporting nothing; logic was moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks health of Land and Asset canisters, displays statuses, and refreshes them periodically with UI feedback.",
  "frontend/src/components/Discovery.tsx": "Manages loot cache discovery and processing, handling token costs, land charge requirements, and updating related queries.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches component errors and displays a styled fallback message.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting UI with hooks for token and governance interactions.",
  "frontend/src/components/LandDashboard.tsx": "Displays land stats, cooldown timers, token actions, modifier usage, and admin debug tools for balances.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implemented content.",
  "frontend/src/components/LandModel.tsx": "Loads a GLTF land model with KTX2 textures, applies emissive and environment settings, and auto-fits the camera based on model bounds.",
  "frontend/src/components/LandSelector.tsx": "Displays a UI card for browsing lands with previous/next controls and localized biome names.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays the top 10 lands leaderboard with styled ranking and token balances.",
  "frontend/src/components/MapView.tsx": "Renders an interactive world map with drag, pinch, and zoom gestures, centering on the user's land using spring animations.",
  "frontend/src/components/Marketplace.tsx": "Provides marketplace UI for browsing, filtering, buying, listing, and canceling land and modifier items.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty component file with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Performs periodic network health checks to an asset canister and displays connection status, latency, and uptime.",
  "frontend/src/components/ParticleBackground.tsx": "Canvas-based particle animation with glow effects and resize handling.",
  "frontend/src/components/PlotCustomization.tsx": "UI to edit a land plot’s name and decoration URL with API mutations.",
  "frontend/src/components/PlugWalletButton.tsx": "Connect/disconnect button for Plug Wallet with dropdown actions.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form that saves a user name via mutation and shows toasts.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay showing connection retry status and progress bar.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and shows a resettable fallback UI.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration for canister IDs, URLs, features, and helpers for model URLs.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides React context for Plug wallet connection, managing connect/disconnect state and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Defines a static list of placeholder modifier items grouped by rarity tiers.",
  "frontend/src/governance-backend.d.ts": "Type definitions for governance backend including proposals, votes, and staking results.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL describing governance backend service methods and data structures.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches backend actors based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook implementing automatic actor reinitialization with gateway rotation and retry logic.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that initializes an actor and performs repeated connectivity and data checks with backoff.",
  "frontend/src/hooks/useAssetActor.ts": "Initializes an asset canister actor with environment validation, gateway health checks, and retry logic. Handles automatic gateway failover and actor creation with timeouts.",
  "frontend/src/hooks/useAssetHealth.ts": "Checks the asset canister’s health via a delayed fetch to its /health endpoint. Returns a simple status state for UI use.",
  "frontend/src/hooks/useAssetUpload.ts": "Provides a GLB upload function using the Plug wallet agent and an asset canister actor. Tracks upload progress, errors, and returns upload results.",
  "frontend/src/hooks/useGovernanceActor.ts": "Builds a governance canister actor with Internet Identity authentication, gateway failover, and retry/timeout logic. Manages actor state, errors, and initialization flow.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook using AuthClient for login, identity loading, and session management. Exposes identity, login actions, and status flags to consumers.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates a marketplace canister actor with identity support and gateway failover, using retries and timeouts similar to the governance actor. Manages initialization state and errors.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query mutation hooks for executing Plug Wallet transactions against token, marketplace, and governance canisters with error handling and cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Implements data-fetching and mutation hooks for land data, user profiles, token balances, and placeholder governance/marketplace types using Internet Identity actors.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes and manages a token canister actor with retry logic, gateway failover, and timeout handling using Internet Identity.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, dark theme variables, neon/glassmorphism effects, and custom fonts for the UI.",
  "frontend/src/lib/buildInfo.ts": "Generates build version metadata, adds cache-busting parameters to URLs, and logs build info at app startup.",
  "frontend/src/lib/debugConfig.ts": "Provides debug utilities for 3D scene logging, performance monitoring, GPU diagnostics, and renderer detection based on debug mode flags.",
  "frontend/src/lib/modelLoader.ts": "Empty placeholder module for future model-loading logic.",
  "frontend/src/lib/tokenUtils.ts": "Provides helpers for formatting and parsing token amounts with fixed decimals, including separator formatting and balance checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/marketplace-backend.d.ts": "Type definitions for marketplace canister interfaces, listings, and buy result variants.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory defining marketplace service methods, listing records, and buy result variants.",
  "frontend/src/pages/Collection.tsx": "Renders a catalog of modifiers with rarity tiers, counts, and styled visual cards.",
  "frontend/src/pages/Dashboard.tsx": "Main user dashboard with tab navigation, land data fetching, and conditional rendering of various modules.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling Internet Identity login with animated visuals and error feedback.",
  "frontend/src/pages/MintingPage.tsx": "Displays land initialization progress and success messages during minting setup.",
  "frontend/src/pages/VerificationPage.tsx": "Page for verifying canister ID configuration with a dedicated verification component.",
  "frontend/src/token-backend.d.ts": "Type definitions for token canister ICRC-1 interfaces including transfers, metadata, and admin controls.",
  "frontend/src/token-backend.idl.ts": "Defines Candid IDL types and service methods for token balance, transfer, metadata, supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript type declarations for WebGPU interfaces to enable compile‑time support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theming, colors, animations, and plugin setup.",
  "frontend/vite.config.ts": "Vite build configuration with React, environment vars, aliases, dev server, and custom asset handling.",
  "project_state.json": "Tracks project state, feature requests, issues, and architectural notes.",
  "README_RUSSIAN.md": "Russian-language deployment guide with requirements and quick-start instructions for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet uploader script sending .glb assets to the AssetCanister with base64 encoding and rate‑limiting.",
  "scripts/upload_assets.sh": "Local script to batch upload tiered .glb model assets to the AssetCanister using dfx.",
  "unknown.txt": "Contains a fragment referencing a health‑endpoint test."
}