{
  "backend/main.mo": "Main Land Canister actor implementing core NFT land minting logic with coordinates, biomes, upgrade levels, token claims, loot caches, modifiers, and access control using OrderedMap storage and inter-canister communication.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for performing a forced full reinstall of Land and Asset canisters on IC mainnet, including prerequisites, backup procedures, and documented canister IDs for all five system canisters.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist for CyberGenesis focusing on environment configuration setup, specifically the creation of a `.env` file in the frontend directory.",
  "DEPLOYMENT_GUIDE.md": "Comprehensive mainnet deployment guide covering prerequisites (dfx CLI, ICP wallet, 45+ GLB model assets) and step-by-step deployment sequence for all five canisters and 3D assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration instructions emphasizing the correct deployment order for all five canisters in the CyberGenesis system.",
  "DEVELOPER_README.md": "Complete developer documentation describing the cyberpunk-themed land NFT DApp architecture with five interconnected canisters (Land, Token, Marketplace, Governance, Asset) and inter-canister communication patterns.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide detailing critical environment variables required for network configuration in the frontend `.env` file.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister configuration errors, covering both local development and mainnet deployment of backend canisters with dfx CLI commands.",
  "feature_evidence.json": "Feature evidence report documenting implemented MapView coordinate system changes including flipped Y-axis, ImageLayer extent configuration, neon ray marker positioning, map physics settings, and debug UI removal.",
  "frontend-file-summaries.txt": "Detailed summaries of all frontend components including styling (Soft Cyberpunk glassmorphism), React Query hooks, routing, 3D rendering (LandModel, CubeVisualization), MapView with Maptalks.js, and Russian language UI throughout.",
  "frontend/.env": "Production environment configuration permanently set to IC mainnet with all five canister IDs, authorized admin principal, multiple boundary node gateways with failover, 120s timeouts, 25 retry attempts, and comprehensive deployment instructions.",
  "frontend/.env.example": "Environment variable template showing required configuration for network settings, all five canister IDs, Internet Identity URL, stability parameters (timeouts/retries), authorized admin principal, and debug mode with examples for local and mainnet.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main application component that manages authentication flow, actor initialization, profile setup, and displays landing/dashboard pages with cosmic/particle backgrounds and reinitialization progress handling.",
  "frontend/src/asset-backend.d.ts": "TypeScript type definitions for the asset backend canister interface, including Asset, UserProfile, UserRole types and all asset management, admin, and user profile methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, specifying service methods for asset management, access control, user profiles, and administrative functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister, defining types and service methods for land management, token claiming, loot caches, modifiers, upgrades, and HTTP transformation functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin component for uploading GLB 3D models to the asset canister with authorization checks, health validation, drag-and-drop support, and progress tracking for valid land types.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with asset canister health monitoring, land type selection, and GLB file upload functionality with validation and progress tracking.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool component that runs comprehensive tests on asset canister connectivity, actor initialization, queries, permissions, cycle balance, and inter-canister communication with detailed logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "React component that provides admin UI for reinitializing the Asset Canister with pre-checks, post-checks, and step-by-step status tracking. Includes authorization verification and health monitoring for both Asset and Land canisters.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Diagnostic tool that tests canister connectivity across multiple IC gateways, measures response times, and generates health reports with recommendations. Supports auto-refresh and provides overall status assessment (online/degraded/offline).",
  "frontend/src/components/CanisterIDVerification.tsx": "UI component that verifies and displays the correctness of configured canister IDs (Land, Cyber Token, Asset, Marketplace, Governance) against expected values, showing visual status indicators for each.",
  "frontend/src/components/ConfigValidator.tsx": "Configuration validation component that checks for required environment variables and displays prominent error/warning banners with quick-fix instructions when critical settings are missing.",
  "frontend/src/components/CosmicBackground.tsx": "Animated 2D canvas background component that renders a cosmic scene with twinkling stars and pulsing nebulae using non-WebGL rendering for visual atmosphere.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders a 3D scene with biome-specific GLTF models, custom FBM shader background sphere, bloom post-processing, and synchronized lighting that follows the camera.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Health monitoring dashboard that checks LandCanister and AssetCanister status, displays connection state with icons, and provides manual refresh functionality with query invalidation.",
  "frontend/src/components/Discovery.tsx": "UI for discovering and processing loot caches with tiered costs (CBR tokens and charge), displays cache inventory, and handles discovery/processing results with toast notifications.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches component errors and displays a styled error notification with optional custom fallback and error callback.",
  "frontend/src/components/Governance.tsx": "Governance interface for staking CBR tokens, creating proposals with title/description validation, and voting on active proposals with weighted voting based on staked balance.",
  "frontend/src/components/LandDashboard.tsx": "Main land management dashboard displaying selected land stats, token balance, cooldown timers for reward claims, upgrade functionality, and modifier inventory with application logic.",
  "frontend/src/components/LandDataDisplay.tsx": "File appears to be empty or contains only whitespace.",
  "frontend/src/components/LandModel.tsx": "React component that loads and renders 3D GLTF land models with KTX2 texture support, applies biome-specific lighting/emissive settings, handles anisotropic filtering, and includes camera auto-fitting and pulsing emissive animation.",
  "frontend/src/components/LandSelector.tsx": "UI component that displays a card with navigation controls (previous/next buttons) to browse through a list of lands, showing the current land's name, biome, and position in the list.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with special styling for top 3 positions and showing each land's name, upgrade level, and CBR token balance.",
  "frontend/src/components/MapView.tsx": "Interactive map component using Maptalks.js library loaded via CDN, displaying all lands as markers with biome-specific colors, neon ray effects, and click interactions to show land details.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for buying/selling lands and modifiers with filtering by type and price, listing management, and integration with backend mutations for transactions and listing operations.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Network monitoring component that performs periodic health checks against the Asset Canister, displays connection status, latency metrics, uptime, and provides expandable diagnostics with visual status indicators.",
  "frontend/src/components/ParticleBackground.tsx": "React component that renders an animated particle background using 2D canvas with moving colored particles and connecting lines between nearby particles.",
  "frontend/src/components/PlotCustomization.tsx": "React component providing UI for customizing land plot properties including plot name (max 20 chars) and decoration URL with mutation hooks for updates.",
  "frontend/src/components/PlugWalletButton.tsx": "React component that renders a Plug Wallet connection button with dropdown menu showing principal ID, copy functionality, and disconnect option when connected.",
  "frontend/src/components/ProfileSetup.tsx": "React component displaying a profile setup form that allows users to enter their name and save it using a mutation hook with toast notifications.",
  "frontend/src/components/ReinitializationProgress.tsx": "React component showing a full-screen overlay with progress indicators during network reconnection attempts, displaying current gateway and attempt count.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React error boundary class component that catches and handles Three.js rendering errors, displaying a fallback UI with retry option instead of crashing.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration file defining ICP network settings, canister IDs, asset URLs, model filenames by tier, wallet configurations, and utility functions for validation and URL generation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration, managing connection state, principal authentication, and actor creation for ICP canisters with toast notifications.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder game modifiers organized by rarity tiers (1-4), each with id, name, rarity, and asset URL properties.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for governance backend interface including proposals, voting, staking operations, and their result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory definition for governance backend service, specifying all method signatures, parameter types, and return types for ICP canister communication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook providing automatic actor reinitialization with gateway rotation across multiple ICP endpoints, implementing retry logic with progressive delays and toast notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization polling logic, validating network connectivity through multiple backend queries with progressive backoff and timeout handling.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and manages an authenticated actor for the Asset Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), health checks, retry logic (25 attempts with exponential backoff), and environment validation. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that monitors Asset Canister health status by polling the /health endpoint with a 1-second delay and 3-second timeout. Returns status as 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using Plug wallet authentication. Reads files as ArrayBuffer, converts to byte arrays, and calls uploadLandModel with progress tracking.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates and manages an authenticated actor for the Governance Canister with automatic gateway failover, 120-second timeout, and 25 retry attempts with exponential backoff. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence in local storage, and delegation validation. Provides status tracking (initializing, idle, logging-in, success, loginError).",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and manages an authenticated actor for the Marketplace Canister with automatic gateway failover, 120-second timeout, and 25 retry attempts with exponential backoff. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query hooks for Plug Wallet transactions across token, marketplace, and governance canisters, including buying/listing/canceling items, staking tokens, and voting on proposals with automatic query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for land data, user profiles, token balances, and placeholder types for governance proposals and marketplace listings with mutation handlers for saving profiles and managing transactions.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a token backend actor with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), retry logic with exponential backoff, and 120-second timeout for Internet Identity authentication.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk-themed dark mode colors (purple-black gradients), Orbitron/JetBrains Mono fonts, glassmorphism effects, and neon glow utilities for cyan, green, purple, and yellow accents.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version information for cache busting, provides URL cache-buster utility with force refresh support, and logs deployment metadata on app initialization.",
  "frontend/src/lib/debugConfig.ts": "Provides debug logging utilities for 3D scene components with GPU context diagnostics, WebGL renderer confirmation, canvas overlap detection, and scene stability testing activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File content is truncated; likely handles 3D model loading utilities for Three.js/R3F scenes based on project context.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 token handling with 8 decimal places, including formatting balances to human-readable strings, parsing decimal amounts to base units (bigint), adding thousands separators, and checking sufficient balance for transactions.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for the marketplace backend canister, including Listing, ItemType enum, BuyResult variant, and marketplace interface methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for the marketplace backend service, defining types and method signatures for marketplace operations.",
  "frontend/src/pages/Collection.tsx": "Collection page component displaying a catalog of modifiers with tier-based styling (Common, Rare, Legendary, Mythic), showing counts and individual modifier cards with rarity-specific visual effects.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tabbed navigation (Land, Discovery, Collection, Leaderboard, Marketplace, Governance, Map) and land selection, fetching and displaying user's land data with loading and error states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with cosmic/particle backgrounds and Internet Identity login button, handling authentication flow with loading and error states.",
  "frontend/src/pages/MintingPage.tsx": "Minting page that displays loading state while initializing land data and actor, showing success message when complete.",
  "frontend/src/pages/VerificationPage.tsx": "Canister ID verification page with CanisterIDVerification component to check proper configuration of all project canister identifiers.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for the ICRC-1 token backend canister, including Account, TransferArgs, TransferError/Result variants, and token interface methods for balance, transfer, metadata, minting, and access control.",
  "frontend/src/token-backend.idl.ts": "Candid IDL factory defining ICRC-1 token standard interfaces including balance queries, transfers, metadata, total supply, and a mint function for token operations.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for WebGPU API, defining interfaces for GPU adapter requests, device descriptors, limits, queues, buffers, and command buffers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both regular query strings and hash-based routing with persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, neon shadow effects, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React, environment variable injection, cache-busting timestamps, WASM asset handling, dev server proxy to local ICP replica, and vendor chunk splitting.",
  "project_state.json": "Project state document tracking a 2D map viewer with flipped Y-axis coordinate system, neon ray markers, and seven implemented features for proper top-down image orientation and map physics.",
  "README_RUSSIAN.md": "Russian-language deployment guide providing overview, requirements (Node.js 18+, dfx, npm/yarn), and quick start instructions for the CyberGenesis virtual land management DApp.",
  "scripts/upload_assets_mainnet.sh": "Mainnet deployment script for uploading GLB model assets to ICP AssetCanister with rate limiting, base64 encoding, progress tracking, and verification of uploaded assets.",
  "scripts/upload_assets.sh": "Bash script for batch uploading 48 tiered 3D model GLB files (12 per tier across 4 tiers) to the AssetCanister on local dfx network with verification.",
  "unknown.txt": "Fragment containing only the text '5. **Test health endpoint:**' with no additional context or implementation details."
}