{
  "backend/main.mo": "Primary Motoko canister implementing land minting logic, data types, registries, access control, and game mechanics.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for force-reinstalling Land and Asset canisters on IC mainnet and re-initializing them after backing up data.",
  "DEPLOYMENT_CHECKLIST.md": "High-level deployment checklist covering environment setup and required .env variables for the frontend.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide for the Land Mint DApp detailing prerequisites and canister creation steps.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief instructions emphasizing correct deployment order for all five canisters.",
  "DEVELOPER_README.md": "Developer overview describing system architecture, five‑canister design, and core DApp functionality.",
  "ENVIRONMENT_CONFIGURATION.md": "Lists required frontend environment variables needed for proper network and canister configuration.",
  "ENVIRONMENT_SETUP.md": "Setup guide for environment variables and backend canister deployment to fix missing‑ID and availability errors.",
  "feature_evidence.json": "Feature evidence report listing shader, fog, and renderer requirements tied to CubeVisualization.tsx.",
  "frontend-file-summaries.txt": "JSON mapping summarizing each frontend file’s functionality, styling, and component behavior.",
  "frontend/.env": "Mainnet‑configured environment variables including all canister IDs, admin principal, and stability settings.",
  "frontend/.env.example": "Template environment file showing required canister IDs, network settings, and admin/debug options.",
  "frontend/index.html": "Minimal HTML entry point loading the React frontend via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling identity, actor initialization, profile loading, and rendering loading, reinitialization, or main UI states.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for asset backend API including assets, profiles, roles, and all asset-related canister methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL defining the asset backend canister interface for asset management, queries, admin functions, and user profiles.",
  "frontend/src/backend.idl.ts": "Candid IDL for the main backend canister defining roles, land data structures, gameplay mechanics, modifiers, and query/update methods.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only GLB upload UI with health checks, authorization verification, drag‑and‑drop handling, and upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel for uploading GLB files with health checks, file validation, and simulated upload progress.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool running multiple tests against the asset canister including actor status, connectivity, permissions, and cycle balance.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Admin-only tool that runs prechecks and reinitialization steps on the asset canister with status tracking and post-checks.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs connectivity and health diagnostics for land and asset canisters across multiple gateways and generates status reports.",
  "frontend/src/components/CanisterIDVerification.tsx": "Compares expected canister IDs with current environment variables and displays correctness status per canister.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and shows a top-level error banner when critical config is missing.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D cosmic starfield and nebula background using a canvas element.",
  "frontend/src/components/CubeVisualization.tsx": "Renders a biome‑based 3D scene with custom shaders, lighting sync, postprocessing bloom, and environment setup using react‑three‑fiber.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file exporting nothing; previous 3D logic was removed.",
  "frontend/src/components/DeploymentVerification.tsx": "Displays and periodically checks health of Land and Asset canisters, updating status and showing toast notifications.",
  "frontend/src/components/Discovery.tsx": "Handles loading, discovering, and processing loot caches with token and charge checks, reacting via UI and toasts.",
  "frontend/src/components/ErrorBoundary.tsx": "Provides a React error boundary that logs errors and displays a fallback UI when child components fail.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting flows with validation, mutation hooks, and user feedback.",
  "frontend/src/components/LandDashboard.tsx": "Shows selected land data, cooldown timers, rewards claiming, upgrades, modifier usage, and admin debug tools.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty or missing content; no functionality shown.",
  "frontend/src/components/LandModel.tsx": "Loads and configures a GLTF land model with KTX2 textures, applies biome-based PBR tweaks, and auto-positions the camera.",
  "frontend/src/components/LandSelector.tsx": "Renders a card UI for browsing land entries with previous/next controls and biome labels.",
  "frontend/src/components/Leaderboard.tsx": "Displays the top 10 lands leaderboard with loading/error states and styled ranking rows.",
  "frontend/src/components/MapView.tsx": "Interactive map canvas supporting drag, pinch, zoom, and centering on user's land using react‑spring and gesture hooks.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for listing, filtering, buying, and managing land and modifier items with mutation handlers.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Runs periodic asset‑canister health checks and displays connection status, latency, and uptime with expandable UI.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas particle background with moving points and connecting lines, handling resize and cleanup.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI to edit a land plot’s name and decoration URL, using mutation hooks to update backend data.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays a Plug Wallet connect button with dropdown for copying principal and disconnecting when connected.",
  "frontend/src/components/ProfileSetup.tsx": "Offers a simple form to set and save a user profile name with validation and toast notifications.",
  "frontend/src/components/ReinitializationProgress.tsx": "Shows a fullscreen modal indicating network reconnection attempts with progress and gateway info.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors, logs them, and displays a fallback UI with reset option.",
  "frontend/src/config/mainnet.ts": "Defines mainnet configuration for canister IDs, asset URLs, wallet settings, and validation utilities.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides a React context for Plug wallet connection, managing connect/disconnect state and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Exports a static list of placeholder modifier items with ids, names, tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "Defines TypeScript interfaces and result types for interacting with the governance backend canister.",
  "frontend/src/governance-backend.idl.ts": "Defines the Candid IDL for the governance backend service including proposals, voting, and staking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance using Internet Identity and react-query, reinitializing on identity change.",
  "frontend/src/hooks/useActorReinitializer.ts": "Implements automatic actor reinitialization with gateway rotation, retries, and status tracking.",
  "frontend/src/hooks/useActorWithInit.ts": "Wraps useActor with additional initialization logic, polling backend readiness and tracking initialization state.",
  "frontend/src/hooks/useAssetActor.ts": "Validates environment, checks gateway health, and initializes an Asset canister actor with retries and failover.",
  "frontend/src/hooks/useAssetHealth.ts": "Performs a delayed health check against the asset canister and returns a simple health status.",
  "frontend/src/hooks/useAssetUpload.ts": "Handles GLB file uploads to the asset canister using Plug wallet, tracking progress and errors.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes a governance canister actor with retries, gateway selection, and Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity persistence, and status management.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes a marketplace canister actor with retries, gateway failover, and Internet Identity integration.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides generic Plug Wallet transaction hook and specific marketplace and governance transaction helpers with query invalidation and error handling.",
  "frontend/src/hooks/useQueries.ts": "Implements data-fetching and mutation hooks for land data, user profiles, token balances, and placeholders for governance and marketplace items using React Query.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes and manages a token canister actor with retry, gateway failover, and timeout logic using Internet Identity.",
  "frontend/src/index.css": "Defines global Tailwind-based styling, fonts, colors, neon effects, and dark-themed visual utilities for the app.",
  "frontend/src/lib/buildInfo.ts": "Generates build metadata, adds cache-busting parameters to URLs, and logs build information on startup.",
  "frontend/src/lib/debugConfig.ts": "Provides debug utilities for 3D rendering, performance logs, GPU diagnostics, and scene stability checks based on environment flags.",
  "frontend/src/lib/modelLoader.ts": "Empty placeholder file for model-loading utilities.",
  "frontend/src/lib/tokenUtils.ts": "Provides utilities to format and parse token amounts and add thousand separators for ICRC-1 tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript definitions for marketplace backend types, listing structures, and API methods.",
  "frontend/src/marketplace-backend.idl.ts": "Defines the Candid IDL factory for the marketplace canister, including item types, listings, and service methods.",
  "frontend/src/pages/Collection.tsx": "Renders the modifier collection page with rarity tiers, counts, and a visual grid of planned modifiers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tab navigation, land data fetching, and module rendering for various game features.",
  "frontend/src/pages/LandingPage.tsx": "Displays the landing page with Internet Identity login flow and animated backgrounds.",
  "frontend/src/pages/MintingPage.tsx": "Shows loading and success states for initializing land data before redirecting to the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Provides a UI for verifying canister IDs with background visuals and navigation back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for the token backend canister, including account structures, transfer types, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines Candid IDL types and service methods for token transfer, metadata, balance, supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript type declarations for WebGPU interfaces to enable compile-time support detection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, themes, plugins, and container settings.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variables, WASM handling, cache-busted builds, aliases, and a dev proxy.",
  "project_state.json": "Tracks project state and feature requests focused on applying Studio Balance shader and fog settings in CubeVisualization.",
  "README_RUSSIAN.md": "Russian‑language deployment quickstart for installing dependencies and running CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet upload script for GLB assets, including rate‑limited uploads, verification, and usage instructions.",
  "scripts/upload_assets.sh": "Local script that uploads tiered GLB model assets to the AssetCanister using dfx and verifies the upload.",
  "unknown.txt": "Contains an incomplete line referencing testing a health endpoint."
}