{
  "backend/main.mo": "Primary LandCanister Motoko code defining land data structures, user profiles, modifiers, caches, and core logic utilities.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for performing a full reinstall and re-initialization of Land and Asset canisters on IC mainnet, including prerequisites and backup steps.",
  "DEPLOYMENT_CHECKLIST.md": "High-level checklist for preparing environment variables and configuration before deploying the CyberGenesis app.",
  "DEPLOYMENT_GUIDE.md": "Step-by-step guide for deploying the full CyberGenesis Land Mint DApp to IC mainnet, including canister and asset preparation.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief deployment instructions emphasizing correct canister deployment order and environment configuration.",
  "DEVELOPER_README.md": "Developer documentation describing the DApp architecture, multi-canister system, and core components of CyberGenesis.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide outlining required frontend environment variables for proper network and canister configuration.",
  "ENVIRONMENT_SETUP.md": "Setup guide covering environment configuration and backend canister deployment to resolve common initialization errors.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend material and rendering updates with associated components and test IDs.",
  "frontend-file-summaries.txt": "Summaries of key frontend source files describing styling, components, animations, hooks, and rendering behaviors.",
  "frontend/.env": "Production IC mainnet environment configuration with finalized canister IDs, admin principal, and stability settings.",
  "frontend/.env.example": "Example environment file showing required variables for network, canisters, admin configuration, and debug options.",
  "frontend/index.html": "Minimal HTML entry point loading the CyberGenesis frontend app and ensuring no-cache directives.",
  "frontend/src/App.tsx": "Main app component handling identity, actor initialization, profile setup flow, and reinitialization UI states.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister including assets, profiles, roles, and API methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory defining the asset canister service, including asset management, admin, access control, and profile functions.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister covering land data, rewards, modifiers, roles, profiles, and HTTP transformations.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin tool for uploading GLB land models with authorization checks, canister health checks, and upload handling.",
  "frontend/src/components/AdminPanel.tsx": "Simple admin UI for checking asset canister health and uploading GLB files with validation and progress simulation.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic panel running detailed tests on asset canister connectivity, permissions, queries, and cycle balance.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "UI component to authorize an admin, run pre- and post-checks, and reinitialize the asset canister with step-by-step status updates.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs connectivity tests across gateways for canisters, generates health reports, and provides status and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Compares environment canister IDs with expected values and displays correctness indicators for each canister.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables and displays blocking errors and warnings when configuration is incomplete.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D cosmic background with stars and nebula effects using a canvas element.",
  "frontend/src/components/CubeVisualization.tsx": "Three.js/React component rendering biome-based 3D scene with custom shaders, lighting sync, fog, and bloom effects.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file exporting nothing; former 3D logic has been moved elsewhere.",
  "frontend/src/components/DeploymentVerification.tsx": "UI component that checks canister health, displays status, refreshes periodically, and shows toast notifications.",
  "frontend/src/components/Discovery.tsx": "Handles loot cache discovery and processing, including cost checks, API calls, and UI state for loading and results.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches render errors and displays a styled fallback alert.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting flows using query hooks and toast feedback.",
  "frontend/src/components/LandDashboard.tsx": "Displays land data, rewards, cooldowns, modifiers, and admin tools with actions like claiming and upgrading plots.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implementation.",
  "frontend/src/components/LandModel.tsx": "Loads and configures a GLTF land model with KTX2 textures, applying biome‑based emissive and PBR settings and updating materials on traversal.",
  "frontend/src/components/LandSelector.tsx": "UI card allowing users to navigate between lands, showing name, biome translation, and index.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays a top‑10 land ranking with loading, error handling, and styled leaderboard entries.",
  "frontend/src/components/MapView.tsx": "Interactive canvas map with gestures, spring physics, and biome rendering, centered on the user’s land.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI handling listing filters, buying, listing, and cancelling items with mutations and dialogs.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Runs periodic health checks against the asset canister and displays connection status, latency, and uptime.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated 2D canvas with moving particles and connecting lines, handling resize and cleanup.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI to edit a land plot's name and decoration URL, integrating update mutations.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays Plug wallet status with connect/disconnect options and a dropdown when connected.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile by submitting a name to the backend.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full‑screen overlay showing connection retry progress, gateway info, and attempt progress bar.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and displays a resettable fallback UI.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration defining canister IDs, URLs, feature flags, and helpers for model URLs and validation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides React context for Plug wallet connection, managing connect/disconnect, principal state, and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Exports a static placeholder list of planned modifiers with ids, names, rarity tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "Defines TypeScript interfaces and result variants for governance backend calls, including proposals, votes, and staking.",
  "frontend/src/governance-backend.idl.ts": "Defines the Candid IDL factory for the governance backend, including records, variants, and service methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity and reinitializes dependent queries on change.",
  "frontend/src/hooks/useActorReinitializer.ts": "Provides automatic actor reinitialization with retry logic, gateway rotation, state tracking, and user notifications.",
  "frontend/src/hooks/useActorWithInit.ts": "Enhances actor usage with initialization tracking, timeouts, and polling backend readiness through multiple health checks.",
  "frontend/src/hooks/useAssetActor.ts": "Creates a resilient asset canister actor with environment validation, gateway health checks, retries, and automatic failover.",
  "frontend/src/hooks/useAssetHealth.ts": "Provides a hook that checks the asset canister’s /health endpoint with a delay and timeout to return healthy or error status.",
  "frontend/src/hooks/useAssetUpload.ts": "Implements GLB upload logic using Plug wallet authentication, reading files, converting bytes, and calling uploadLandModel.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes a governance canister actor with Internet Identity, retries, timeout handling, and automatic gateway selection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and provider logic for login, identity persistence, and accessing authentication state.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes a marketplace canister actor with Internet Identity, retries, timeout handling, and optimal gateway selection.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides reusable React Query mutation hooks for executing Plug Wallet transactions across token, marketplace, and governance canisters, including actor creation and query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating land data, user profiles, token balances, and placeholder marketplace/governance types.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes a token canister actor with retries, gateway failover, and timeout handling using Internet Identity credentials.",
  "frontend/src/index.css": "Global Tailwind-based styling with dark theme variables, neon effects, and custom fonts for the app UI.",
  "frontend/src/lib/buildInfo.ts": "Exposes build timestamp and version info and utilities for cache busting and logging build metadata.",
  "frontend/src/lib/debugConfig.ts": "Centralized debug utilities for 3D rendering, including logging, GPU diagnostics, renderer detection, and performance tracking.",
  "frontend/src/lib/modelLoader.ts": "Empty file or stub for future model loading utilities.",
  "frontend/src/lib/tokenUtils.ts": "Provides utilities to format and parse ICRC-1 token amounts and apply thousand separators.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/marketplace-backend.d.ts": "Type definitions for the marketplace canister including listings, item types, and buy results.",
  "frontend/src/marketplace-backend.idl.ts": "Exports the Candid IDL factory for the marketplace canister service and data structures.",
  "frontend/src/pages/Collection.tsx": "Renders the modifier collection page with rarity counts and styled tier displays.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard managing tab navigation, land selection, and loading land data via actor queries.",
  "frontend/src/pages/LandingPage.tsx": "Landing page handling Internet Identity login with animated UI elements.",
  "frontend/src/pages/MintingPage.tsx": "Displays land minting initialization status and loading indicators.",
  "frontend/src/pages/VerificationPage.tsx": "Page for validating canister configuration IDs with a visual check component.",
  "frontend/src/token-backend.d.ts": "Type definitions for the token canister including accounts, transfers, metadata, and admin functions.",
  "frontend/src/token-backend.idl.ts": "Defines Candid IDL types and service methods for token operations like balance, transfer, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript definitions for WebGPU interfaces to allow API usage and feature detection without errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, shadows, and enabling plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, WASM handling, build timestamping, aliases, and dev server proxy settings.",
  "project_state.json": "Project state metadata describing emissive intensity fixes for LandModel.tsx with feature requests and architectural notes.",
  "README_RUSSIAN.md": "Russian-language deployment overview and quick start instructions for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Mainnet script uploading .glb assets to the AssetCanister with rate limiting and verification steps.",
  "scripts/upload_assets.sh": "Local script to batch‑upload tiered .glb model files to an AssetCanister using dfx.",
  "unknown.txt": "Contains a brief note referencing testing a health endpoint."
}