{
  "backend/main.mo": "Motoko actor implementing core land minting logic, data types, access control, and registries for land, users, and loot.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for fully reinstalling Land and Asset canisters on IC mainnet, including prerequisites and canister IDs.",
  "DEPLOYMENT_CHECKLIST.md": "High-level checklist for preparing environment variables and configuration before deploying CyberGenesis.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide describing prerequisites and the sequence for deploying all canisters and assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief deployment steps focusing on correct environment configuration and canister deployment order.",
  "DEVELOPER_README.md": "Developer documentation describing the DApp architecture, canister roles, and overall system design.",
  "ENVIRONMENT_CONFIGURATION.md": "List of required environment variables for frontend .env configuration.",
  "ENVIRONMENT_SETUP.md": "Guide for setting environment variables and deploying backend canisters to fix configuration errors.",
  "feature_evidence.json": "Feature evidence report mapping specific frontend lighting and material behaviors to source files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of key frontend files and components.",
  "frontend/.env": "Production IC mainnet environment configuration containing required canister IDs and stability settings.",
  "frontend/.env.example": "Template environment config showing required variables for canister IDs, network settings, and debug options.",
  "frontend/index.html": "Base HTML entry file loading the Vite React app and disabling caching.",
  "frontend/src/App.tsx": "Main app component handling identity, actor initialization, profile setup, and reinitialization states with animated loading screens.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister, including asset management, user profiles, and admin functions.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL for the asset backend canister defining asset operations, access control, and user profile APIs.",
  "frontend/src/backend.idl.ts": "Candid IDL for the main backend canister covering lands, rewards, modifiers, user roles, and system queries.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin interface for uploading GLB models with authorization checks, health checks, and upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Expandable admin panel enabling GLB uploads and periodic asset canister health checks.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool running multiple tests on the asset canister including connectivity, permissions, queries, and cycle balance.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Admin-only tool to run prechecks, reinitialize the asset canister, and validate its post‑state using status steps and actor calls.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs periodic health checks on land and asset canisters across IC gateways and generates status reports with recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Compares environment-defined canister IDs with expected values and displays correctness indicators for each.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables and shows a fixed error banner listing missing or incorrect configuration entries.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D cosmic background with stars and nebula effects using a canvas.",
  "frontend/src/components/CubeVisualization.tsx": "Loads and displays biome-specific 3D models using three.js with lighting, environment, and orbit controls.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file kept after moving 3D logic to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks the health of Land and Asset canisters by invoking actor methods and displays real‑time status with refresh and toast notifications.",
  "frontend/src/components/Discovery.tsx": "Handles loading, discovering, and processing loot caches based on land charge and token balance, with UI state and toast feedback.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches render errors and displays a styled fallback or custom fallback component.",
  "frontend/src/components/Governance.tsx": "Provides staking, proposal creation, and voting UI logic using governance-related query hooks with validation and toast messaging.",
  "frontend/src/components/LandDashboard.tsx": "Displays land data, cooldown timers, rewards claiming, upgrading, and modifier interactions along with optional admin debugging tools.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implementation.",
  "frontend/src/components/LandModel.tsx": "Loads and displays a GLTF land model with KTX2 textures, applies biome-based material tweaks, and auto-fits the camera to the model.",
  "frontend/src/components/LandSelector.tsx": "UI component for selecting and navigating between lands, displaying name, biome and index with previous/next controls.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays top land rankings with loading/error states and styled leaderboard entries.",
  "frontend/src/components/MapView.tsx": "Interactive canvas-based map viewer with panning, zooming, gestures and biome-based land highlighting.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for filtering, buying, listing and canceling listings for lands and modifiers.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty component placeholder with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Periodically checks canister connectivity and latency, displaying connection status and metrics.",
  "frontend/src/components/ParticleBackground.tsx": "Animated 2D particle background using canvas with glowing particles and connecting lines.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI to edit a land plot’s name and decoration URL using query mutations.",
  "frontend/src/components/PlugWalletButton.tsx": "Renders a connect button or connected dropdown for Plug Wallet with copy and disconnect actions.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a profile creation form that saves the user’s name via a mutation.",
  "frontend/src/components/ReinitializationProgress.tsx": "Shows a fullscreen reconnecting status overlay with attempt and gateway details.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors and displays a resettable fallback UI.",
  "frontend/src/config/mainnet.ts": "Defines mainnet config, canister IDs, model URLs, validation, and initialization helpers.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides context for Plug Wallet connection, principal management, and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Defines a static list of placeholder modifier items with IDs, names, rarity tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "TypeScript types for governance backend data structures and API methods including proposals, voting, and staking.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL definitions for governance backend types and service methods matching the TypeScript interface.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on user identity and refreshes queries when the actor updates.",
  "frontend/src/hooks/useActorReinitializer.ts": "Provides automatic multi-gateway actor reinitialization with retries, delay handling, and success/error callbacks.",
  "frontend/src/hooks/useActorWithInit.ts": "Extends useActor with backend initialization polling, timeouts, identity tracking, and connectivity validation.",
  "frontend/src/hooks/useAssetActor.ts": "Creates an asset canister actor with environment validation, gateway health checks, retries, and failover logic.",
  "frontend/src/hooks/useAssetHealth.ts": "Simple hook that checks the asset canister's /health endpoint with timeout and reports healthy or error status.",
  "frontend/src/hooks/useAssetUpload.ts": "Provides a React hook to upload GLB files to an asset canister using Plug Wallet, tracking progress and errors.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes and retries creation of a governance canister actor with Internet Identity, using gateway failover and timeout handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, login state, and persisted identities via AuthClient.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and retries initialization of a marketplace canister actor with Internet Identity, including gateway failover and timeouts.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Defines generic and specific Plug Wallet transaction hooks for token, marketplace, and governance canisters with React Query integration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching land data, profiles, balances, and performing mutations via various backend actors.",
  "frontend/src/hooks/useTokenActor.ts": "React hook that initializes and retries creation of a token canister actor with gateway failover, timeout handling, and Internet Identity support.",
  "frontend/src/index.css": "Global Tailwind-based styling defining dark theme colors, fonts, and neon/glassmorphism visual effects.",
  "frontend/src/lib/buildInfo.ts": "Provides build timestamp/version metadata and utilities for cache-busting URLs, plus build info logging.",
  "frontend/src/lib/debugConfig.ts": "Debug utilities for 3D scene diagnostics, including logging, performance checks, GPU context info, and renderer detection.",
  "frontend/src/lib/modelLoader.ts": "Empty placeholder module for model-loading utilities.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for formatting, parsing, and validating ICRC-1 token amounts using CBR’s 8‑decimal format.",
  "frontend/src/main.tsx": "Application entry point that sets up React rendering with Internet Identity and React Query providers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript definitions for the marketplace canister interface, including listings, item types, and buy result variants.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory defining the marketplace canister service, item types, listing records, and buy result variants.",
  "frontend/src/pages/Collection.tsx": "Displays a modifier collection with rarity counts and styled tier indicators using data from PLANNED_MODIFIER_CATALOG.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard managing land data, tabs for different views, and rendering components like LandDashboard, Discovery, and MapView.",
  "frontend/src/pages/LandingPage.tsx": "Landing page handling Internet Identity login with animated UI elements and background effects.",
  "frontend/src/pages/MintingPage.tsx": "Initializes land data and shows loading or success messages before redirecting to the dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Renders a canister ID verification interface with a styled layout and link back to the homepage.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for the token backend, including account, transfer types, errors, and token-related methods.",
  "frontend/src/token-backend.idl.ts": "IDL factory defining the token backend canister interface, including transfer, metadata, and mint operations.",
  "frontend/src/types/webgpu.d.ts": "Type declarations enabling WebGPU API support and preventing TypeScript errors during feature detection.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including hash), persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and container settings for the frontend UI.",
  "frontend/vite.config.ts": "Defines Vite build settings, plugins, env handling, proxy rules, asset naming, and WASM inclusion.",
  "project_state.json": "Stores project metadata, PBR rendering requirements, architectural rules, issues, and tracked feature specs.",
  "README_RUSSIAN.md": "Russian-language deployment overview and quick start instructions for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Uploads .glb assets to the ICP mainnet AssetCanister with validation, rate limiting, and status reporting.",
  "scripts/upload_assets.sh": "Uploads tiered .glb model files to the local AssetCanister using dfx and prints results and sample URLs.",
  "unknown.txt": "Contains a brief note referencing a test health endpoint."
}