{
  "backend/main.mo": "Main LandCanister actor implementing core land NFT logic including minting, claiming, upgrades, loot caches, modifications, and access control with authorized admin principal and inter-canister communication.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for performing a forced full reinstall of Land and Asset canisters on IC mainnet, including prerequisites, backup procedures, and canister IDs for all five system canisters.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist focusing on environment configuration setup, specifically the creation of a `.env` file in the frontend directory with required variables.",
  "DEPLOYMENT_GUIDE.md": "Comprehensive mainnet deployment guide covering prerequisites, deployment sequence for all five canisters, and handling of 45+ 3D model assets in the AssetCanister.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration instructions emphasizing the correct deployment order for all five canisters in the system.",
  "DEVELOPER_README.md": "Complete developer documentation covering the multi-canister architecture (LandCanister, CyberTokenCanister, MarketplaceCanister, GovernanceCanister, AssetCanister), inter-canister communication, and project status as audit-ready.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide detailing critical environment variables required for network configuration and canister ID setup in the application.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister configuration errors, covering both local development and mainnet deployment of backend canisters with dfx CLI.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: HDRI environment update in CubeVisualization, biome-specific lighting configuration in LandModel, and pulse animation formula updates.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including styling, hooks, pages, 3D visualization components, and their specific implementations for the Soft Cyberpunk Space Noir themed UI.",
  "frontend/.env": "Production environment configuration permanently set to IC mainnet with all five canister IDs, admin authorization principal, network stability settings, and comprehensive deployment instructions with multi-gateway failover support.",
  "frontend/.env.example": "Environment variables template with examples for both local and mainnet configurations, including canister IDs, network settings, admin principal, and 3D debug mode options.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags and root div for React application mounting.",
  "frontend/src/App.tsx": "Main application component that handles authentication flow, actor initialization, profile setup, and displays landing/dashboard pages with cosmic/particle backgrounds and reinitialization progress.",
  "frontend/src/asset-backend.d.ts": "TypeScript type definitions for the asset backend canister interface, including Asset, UserProfile, UserRole types and all asset management, admin, and user profile methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister service, defining all asset management, query, administrative, access control, and user profile functions with their parameter and return types.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister, defining types and methods for land management, token claiming, loot caches, modifiers, upgrades, and HTTP transformation functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin component for uploading GLB 3D models to the asset canister with authorization checks, health validation, drag-and-drop support, and progress tracking for valid land types.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with asset canister health monitoring, land type selection, and GLB file upload functionality with validation and progress tracking.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool component that runs comprehensive tests on asset canister connectivity, actor initialization, authentication, queries, permissions, cycle balance, and inter-canister communication with detailed logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "React component that provides admin UI for reinitializing the Asset Canister, including pre-checks, reinitialization steps, and post-checks with authorization verification.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Diagnostic tool that tests canister connectivity across multiple IC gateways, measures response times, and generates health reports with recommendations for Land and Asset canisters.",
  "frontend/src/components/CanisterIDVerification.tsx": "UI component that verifies and displays the correctness of configured canister IDs (Land, Cyber Token, Asset, Marketplace, Governance) against expected values from environment variables.",
  "frontend/src/components/ConfigValidator.tsx": "Validation component that checks for required environment variables at runtime and displays critical configuration errors with quick-fix instructions if any are missing.",
  "frontend/src/components/CosmicBackground.tsx": "Animated 2D canvas background component that renders a cosmic scene with twinkling stars and pulsing nebulae using non-WebGL rendering for visual ambiance.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders a 3D scene with biome-specific GLTF models, custom FBM shader background sphere, bloom post-processing, and synchronized lighting that follows the camera.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Health monitoring dashboard that checks LandCanister and AssetCanister status, displays connection state with icons, and provides manual refresh functionality with toast notifications.",
  "frontend/src/components/Discovery.tsx": "UI for discovering and processing loot caches with tiered costs (CBR tokens and charge), displays cache inventory, and handles discovery/processing results with error handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches component errors and displays a styled error notification with optional custom fallback and error callback.",
  "frontend/src/components/Governance.tsx": "Governance interface for staking CBR tokens, creating proposals with title/description validation, and voting on active proposals with weighted voting based on stake.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard displaying selected land data including token balance, cooldown timers for reward claims, upgrade functionality, and admin debug controls for token balances.",
  "frontend/src/components/LandDataDisplay.tsx": "File appears to be empty or contains only whitespace.",
  "frontend/src/components/LandModel.tsx": "React component that loads and renders 3D GLTF land models with KTX2 texture support, applies biome-specific lighting/emissive settings, and handles camera fitting and animation frame updates.",
  "frontend/src/components/LandSelector.tsx": "UI component for navigating through owned lands with previous/next buttons, displaying land name, biome type in Russian, and current position in the collection.",
  "frontend/src/components/Leaderboard.tsx": "Displays top 10 lands ranked by token balance with special styling for top 3 positions, showing plot name, upgrade level, and CBR token balance.",
  "frontend/src/components/MapView.tsx": "Interactive canvas-based map viewer with drag, pinch-zoom, and wheel gestures using react-spring physics, rendering all lands with biome-specific colors and highlighting the owner's land.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for buying/selling lands and modifiers with filtering by type and price, listing management, and integration with marketplace backend mutations.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Network health monitoring component that performs periodic health checks against the Asset Canister, displays connection status, latency metrics, and uptime statistics.",
  "frontend/src/components/ParticleBackground.tsx": "React component that renders an animated particle background using 2D canvas with moving colored particles and connecting lines between nearby particles.",
  "frontend/src/components/PlotCustomization.tsx": "React component for customizing land plot properties including plot name (max 20 chars) and decoration URL with mutation hooks for updates.",
  "frontend/src/components/PlugWalletButton.tsx": "React component that displays a Plug Wallet connection button with dropdown menu showing principal ID, copy functionality, and disconnect option when connected.",
  "frontend/src/components/ProfileSetup.tsx": "React component that displays a profile setup form for new users to enter their name and create their CyberGenesis profile.",
  "frontend/src/components/ReinitializationProgress.tsx": "React component that displays a full-screen overlay showing connection reinitialization progress with attempt counter, current gateway, and animated progress bar.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React error boundary class component that catches and handles 3D rendering errors, displaying a fallback UI with retry option instead of crashing the canvas.",
  "frontend/src/config/mainnet.ts": "Configuration file for ICP mainnet deployment containing canister IDs, asset URLs, model filenames, wallet settings, feature flags, and utility functions for mainnet initialization and validation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration, managing connection state, principal authentication, and actor creation for Internet Computer canisters.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder game modifiers organized by rarity tiers (1-4), each with id, name, rarity, and asset URL properties.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for governance backend interface including proposals, voting, staking operations, and their result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory definition for governance backend service, specifying all method signatures and data structures for IC canister communication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, using React Query for caching and automatic invalidation.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook providing automatic actor reinitialization with gateway rotation across multiple IC endpoints, implementing retry logic with progressive delays up to 3 attempts.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization polling logic, performing multiple connectivity validation checks with progressive backoff to ensure backend readiness.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and manages an authenticated Actor for the Asset Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), health checks, retry logic (25 attempts with exponential backoff), and environment validation. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that monitors Asset Canister health status by fetching the /health endpoint with a 1-second delay and 3-second timeout, returning 'checking', 'healthy', or 'error' status.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using Plug wallet authentication, converting files to byte arrays and calling the uploadLandModel method with progress tracking and error handling.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates and manages an authenticated Actor for the Governance Canister with automatic gateway failover, 120-second timeout, retry logic (25 attempts), and Internet Identity integration for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence in local storage, delegation validation, and authentication status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and manages an authenticated Actor for the Marketplace Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), 120-second timeout, retry logic (25 attempts), and Internet Identity integration.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query hooks for Plug Wallet transactions across token, marketplace, and governance canisters, including buying/listing items, staking tokens, and voting on proposals with automatic query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for land data, user profiles, token balances, and placeholder types for governance proposals and marketplace listings with retry logic and error handling.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a token canister actor with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), retry logic (25 attempts), and 120-second timeout for Internet Identity authentication.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk-themed dark mode colors (purple-black gradients), Orbitron/JetBrains Mono fonts, glassmorphism effects, and neon glow utilities (cyan, green, purple, yellow).",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version information for cache busting, providing functions to append version query parameters to URLs and log deployment metadata.",
  "frontend/src/lib/debugConfig.ts": "Provides debug logging utilities for 3D scene components with GPU context diagnostics, renderer detection, and scene stability tests, activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File content is truncated; likely handles 3D model loading functionality for Three.js scenes.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 token handling with 8 decimal places, including formatting balances to human-readable strings, parsing decimal amounts to bigint base units, adding thousands separators, and checking sufficient balance for transactions.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for the marketplace backend canister, including Listing interface, ItemType enum, BuyResult variant, and marketplace interface methods for listing, buying, and querying items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for the marketplace backend service, defining types and methods matching the TypeScript declarations.",
  "frontend/src/pages/Collection.tsx": "Displays a catalog of all available modifiers organized by rarity tiers (Common, Rare, Legendary, Mythic) with visual styling, tier counts, and detailed modifier cards showing stats and effects.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tabbed navigation (Land, Discovery, Collection, Leaderboard, Marketplace, Governance, Map) that manages land selection and displays the appropriate view based on active tab.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with cosmic background that prompts users to connect via Internet Identity, displaying login status and error messages with animated visual effects.",
  "frontend/src/pages/MintingPage.tsx": "Transitional page that shows loading state while initializing land data, then redirects to dashboard once complete.",
  "frontend/src/pages/VerificationPage.tsx": "Administrative page for verifying canister ID configuration across the project with a CanisterIDVerification component and navigation back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for the ICRC-1 token backend canister, including Account, TransferArgs, TransferError/Result types, and token interface methods for balance queries, transfers, minting, and access control.",
  "frontend/src/token-backend.idl.ts": "Candid IDL factory defining ICRC-1 token standard interfaces including Account, TransferArgs, TransferError, and service methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for WebGPU API including GPU adapter/device interfaces, limits, descriptors, and navigator extensions to enable WebGPU feature detection without compilation errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, sidebar theming, neon shadow effects, accordion animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React, environment variable injection, WASM/basis transcoder asset handling, cache-busting timestamps, code splitting for React/Three.js vendors, and COOP/COEP headers for SharedArrayBuffer support.",
  "project_state.json": "Project state tracking document for CyberGenesis 3D land NFT app, documenting Visual Engine configuration with Artist Workshop HDRI, biome-specific lighting parameters, and smart pulse animation implementation across three completed feature requests.",
  "README_RUSSIAN.md": "Russian-language deployment guide providing overview, requirements, and quick start instructions for the CyberGenesis land management DApp with 3D visualization.",
  "scripts/upload_assets_mainnet.sh": "Mainnet deployment script for uploading .glb 3D models to AssetCanister on ICP with rate limiting (2s delays), base64 encoding, progress tracking, and post-upload verification.",
  "scripts/upload_assets.sh": "Bash script for batch uploading 48 tiered 3D model files (tier1-4, 12 models each) to AssetCanister on local dfx network with base64 encoding and verification.",
  "unknown.txt": "Fragment containing only \"5. **Test health endpoint:**\" with no additional context or content."
}