{
  "backend/main.mo": "Main Land Canister actor implementing core land NFT logic including minting, claiming rewards, upgrades, biome determination, access control, loot caches, modifications, and energy boosters with ICRC-1 token integration.",
  "CANISTER_REINSTALL_GUIDE.md": "Step-by-step guide for performing a forced full reinstall of Land and Asset canisters on IC mainnet, including backup procedures and canister IDs for all five system canisters.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist focusing on environment configuration setup, specifically the creation of a `.env` file in the frontend directory.",
  "DEPLOYMENT_GUIDE.md": "Comprehensive mainnet deployment guide covering prerequisites, deployment sequence for all five canisters, and handling of 45+ 3D model assets in the assets directory.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Critical environment configuration instructions emphasizing the correct deployment order of all five canisters.",
  "DEVELOPER_README.md": "Complete developer documentation covering the multi-canister architecture (LandCanister, CyberTokenCanister, MarketplaceCanister, GovernanceCanister, AssetCanister), inter-canister communication, and project status as audit-ready.",
  "ENVIRONMENT_CONFIGURATION.md": "Guide detailing critical environment variables required in `frontend/.env`, focusing on network configuration settings.",
  "ENVIRONMENT_SETUP.md": "Setup guide for resolving Asset Canister ID and canister availability errors, covering both local development and mainnet deployment of backend canisters.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence tasks: removing Russian dithering comments (lines 323-325) and adding `dithering: true` to Canvas gl props in CubeVisualization.tsx.",
  "frontend-file-summaries.txt": "Detailed summaries of all frontend components including 3D rendering (CubeVisualization, LandModel), UI pages (Dashboard, LandingPage, MintingPage), map visualization, particle effects, and styling with Soft Cyberpunk Space Noir glassmorphism theme.",
  "frontend/.env": "Production environment configuration permanently set to IC mainnet with all five canister IDs, admin authorization principal, network stability settings (120s timeouts, 25 retries), and multi-gateway failover configuration.",
  "frontend/.env.example": "Example environment variables template showing required canister IDs, network configuration, Internet Identity URL, stability settings, admin principal, and debug mode with examples for both local and mainnet deployment.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and module script loading for the React application root.",
  "frontend/src/App.tsx": "Main application component that manages authentication flow, actor initialization, profile setup, and displays landing/dashboard pages with cosmic/particle backgrounds and reinitialization progress handling.",
  "frontend/src/asset-backend.d.ts": "TypeScript type definitions for the asset backend canister interface, including Asset, UserProfile, UserRole types and all asset management, admin, and user profile methods.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory definition for the asset backend canister, specifying all service methods for asset management, access control, and user profiles with their parameter and return types.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister, defining types and methods for land management, token claiming, loot caches, modifiers, upgrades, and HTTP transformation functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin component for uploading GLB 3D models to specific land types, with authorization checks against a hardcoded admin principal and asset canister health verification before allowing uploads.",
  "frontend/src/components/AdminPanel.tsx": "Collapsible admin panel component that performs periodic health checks on the asset canister and provides UI for selecting land types and uploading GLB files with progress tracking.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostic tool component that runs comprehensive tests on the asset canister including actor initialization, network connectivity, authentication, queries, permissions, cycle balance, and inter-canister communication with detailed logging.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "React component that provides an admin interface to reinitialize the Asset Canister with pre-checks, step-by-step reinitialization process, and post-checks to verify health. Includes authorization verification and detailed status reporting for each step.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Diagnostic tool that tests canister connectivity across multiple IC gateways, measures response times, and generates health reports with recommendations. Supports auto-refresh and provides overall status assessment (online/degraded/offline).",
  "frontend/src/components/CanisterIDVerification.tsx": "UI component that verifies and displays the correctness of all canister IDs (Land, Cyber Token, Asset, Marketplace, Governance) by comparing environment variables against expected values. Shows visual status indicators for each canister.",
  "frontend/src/components/ConfigValidator.tsx": "Configuration validation component that checks for required environment variables at startup and displays a prominent error banner with quick-fix instructions if critical configuration is missing. Only renders when validation fails.",
  "frontend/src/components/CosmicBackground.tsx": "Animated 2D canvas background component that renders a cosmic scene with twinkling stars and pulsing nebulae using non-WebGL rendering for visual atmosphere.",
  "frontend/src/components/CubeVisualization.tsx": "React Three Fiber component that renders 3D land models based on biome type, with custom FBM shader background, bloom post-processing, and dynamic lighting synchronized to camera position.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D rendering logic has been moved to LandModel.tsx.",
  "frontend/src/components/DeploymentVerification.tsx": "Dashboard component that monitors health status of LandCanister and AssetCanister, displays build info, and provides manual refresh functionality with toast notifications.",
  "frontend/src/components/Discovery.tsx": "UI for discovering and processing loot caches with tiered costs (CBR tokens and charge), displaying cache inventory and handling discovery/processing results.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches component errors and displays a styled error notification with optional custom fallback and error callback.",
  "frontend/src/components/Governance.tsx": "Governance interface for staking CBR tokens, creating proposals, and voting on active proposals with validation and result handling.",
  "frontend/src/components/LandDashboard.tsx": "Dashboard displaying selected land data including token balance, claim rewards with cooldown timer, plot upgrades, modifier inventory, and admin debug controls.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/LandModel.tsx": "React component that loads and renders a 3D GLTF land model using Three.js and react-three/fiber, with KTX2 texture support, PBR material configuration, conditional emissive lighting based on texture maps, biome-specific environment settings, and automatic camera fitting.",
  "frontend/src/components/LandSelector.tsx": "UI component that displays a card with navigation controls to browse through a list of lands, showing the current land's name, biome (with Russian translations), and position in the collection.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top-10 leaderboard of lands ranked by token balance, with special styling for top 3 positions (gold, silver, bronze) and showing each land's name, upgrade level, and CBR token balance.",
  "frontend/src/components/MapView.tsx": "Interactive map viewer component with pan, pinch-zoom, and wheel-zoom gestures using react-spring physics, displaying all lands on a background map image with biome-colored markers and centering on the user's owned land.",
  "frontend/src/components/Marketplace.tsx": "Marketplace UI for buying, selling, and listing lands and modifiers with filtering by type and price range, dialog for creating listings, and handling purchase/cancellation transactions with toast notifications.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Network health monitoring component that performs periodic health checks against the Asset Canister, displays connection status with latency metrics, uptime tracking, and expandable diagnostics panel with status indicators.",
  "frontend/src/components/ParticleBackground.tsx": "React component that renders an animated particle background using 2D canvas with moving particles, glow effects, and connecting lines between nearby particles.",
  "frontend/src/components/PlotCustomization.tsx": "UI component for customizing land plot properties including plot name (max 20 chars) and decoration URL, using React Query mutations to update backend state.",
  "frontend/src/components/PlugWalletButton.tsx": "Wallet connection button component that displays connect/disconnect UI with dropdown menu showing principal ID and copy/disconnect actions when connected.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form component that prompts new users to enter their name and saves it via React Query mutation with toast notifications.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full-screen overlay component displaying connection retry progress with attempt counter, current gateway info, and animated progress bar during network reinitialization.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "React Error Boundary class component that catches 3D rendering errors, logs them, and displays a fallback UI with retry button instead of crashing the canvas.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration file defining ICP network settings, canister IDs, asset URLs, model filenames by tier, wallet configs, feature flags, and helper functions for initialization and validation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "React context provider for Plug Wallet integration, managing connection state, principal authentication, and actor creation for Internet Computer canisters.",
  "frontend/src/data/modifierCatalog.ts": "Static catalog of 45+ placeholder game modifiers organized by rarity tiers (1-4), each with id, name, rarity, and asset URL properties.",
  "frontend/src/governance-backend.d.ts": "TypeScript type definitions for governance backend interface including proposals, voting, staking operations, and their result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory definition for governance backend service, specifying all governance-related methods and data structures for ICP canister communication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook providing automatic actor reinitialization with gateway rotation across multiple ICP endpoints, implementing retry logic with progressive delays up to 3 attempts.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook that wraps useActor with initialization polling logic, validating backend connectivity through multiple health checks with progressive backoff delays up to 120 seconds.",
  "frontend/src/hooks/useAssetActor.ts": "Creates and manages an authenticated Actor for the Asset Canister with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), health checks, retry logic (25 attempts with exponential backoff), and environment validation. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useAssetHealth.ts": "React hook that monitors Asset Canister health by fetching the /health endpoint with a 1-second delay, 3-second timeout, and cache-busting. Returns status: 'checking', 'healthy', or 'error'.",
  "frontend/src/hooks/useAssetUpload.ts": "React hook for uploading GLB files to the Asset Canister using Plug wallet authentication. Reads files as ArrayBuffer, converts to byte array, calls uploadLandModel method, and tracks upload progress with error handling.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates and manages an authenticated Actor for the Governance Canister with automatic gateway failover, 120-second timeout, and 25 retry attempts with exponential backoff. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages login state, identity persistence, delegation validation, and provides login/logout functions with configurable idle options and derivation origin.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Creates and manages an authenticated Actor for the Marketplace Canister with automatic gateway failover, 120-second timeout, and 25 retry attempts with exponential backoff. Integrates with Internet Identity for authentication.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query hooks for Plug Wallet transactions across token, marketplace, and governance canisters, including buying/listing items, staking tokens, and voting on proposals with automatic query invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for land data, user profiles, token balances, and placeholder types for governance proposals and marketplace listings with retry logic and error handling.",
  "frontend/src/hooks/useTokenActor.ts": "Creates and manages a token canister actor with automatic gateway failover (ic0.app, boundary.ic0.app, icp-api.io), retry logic up to 25 attempts, and 120-second timeout for Internet Identity authentication.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk-themed dark mode colors (purple-black gradients), Orbitron/JetBrains Mono fonts, glassmorphism effects, and neon glow utilities for cyan, green, purple, and yellow.",
  "frontend/src/lib/buildInfo.ts": "Exports build timestamp and version information for cache busting, providing functions to append version query parameters to URLs and log deployment metadata.",
  "frontend/src/lib/debugConfig.ts": "Provides debug logging utilities for 3D scene components with GPU context diagnostics, WebGL renderer detection, canvas overlap detection, and scene stability testing activated via environment variables or query parameters.",
  "frontend/src/lib/modelLoader.ts": "File content is truncated; likely handles 3D model loading utilities for Three.js/R3F components.",
  "frontend/src/lib/tokenUtils.ts": "Utility functions for ICRC-1 token handling with 8 decimal places, including formatting balances to human-readable strings, parsing decimal amounts to base units (bigint), and checking sufficient balance for transactions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/marketplace-backend.d.ts": "TypeScript type definitions for marketplace backend canister interface, including Listing type, ItemType enum (Land/Modifier), BuyResult variant, and methods for listing, buying, and querying marketplace items.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory definition for marketplace backend service, defining the interface types and methods that match the TypeScript declarations for on-chain marketplace operations.",
  "frontend/src/pages/Collection.tsx": "Collection page component displaying a catalog of modifiers with tier-based styling (Common, Rare, Legendary, Mythic), showing counts per tier and rendering modifier cards with rarity-specific visual effects.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tab navigation (Land, Discovery, Collection, Leaderboard, Marketplace, Governance, Map) that fetches user land data and manages selected land state with multi-land support.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with cosmic/particle backgrounds that handles Internet Identity login flow, displays animated hero section with cyberpunk styling, and shows login status with error handling.",
  "frontend/src/pages/MintingPage.tsx": "Minting page that displays loading state while initializing land data through actor and queries, showing success message once land data is ready before redirecting to dashboard.",
  "frontend/src/pages/VerificationPage.tsx": "Verification page for checking canister ID configuration, displaying CanisterIDVerification component with cosmic background and navigation back to home.",
  "frontend/src/token-backend.d.ts": "TypeScript type definitions for ICRC-1 token backend canister, including Account, TransferArgs, TransferError/Result types, and methods for balance queries, transfers, minting, and access control.",
  "frontend/src/token-backend.idl.ts": "Candid IDL factory defining ICRC-1 token standard interfaces including Account, TransferArgs, TransferError, and service methods for balance queries, transfers, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "TypeScript type declarations for WebGPU API, defining interfaces for GPU, GPUAdapter, GPUDevice, GPULimits, and related types to enable WebGPU feature detection without compilation errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both standard query strings and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, extended utilities for borders, shadows (including neon effects), animations (accordion), and container settings with responsive breakpoints.",
  "frontend/vite.config.ts": "Vite configuration for React app with environment variable injection, build timestamp for cache busting, proxy setup for local API, CORS headers for SharedArrayBuffer, and special handling for WASM/basis transcoder assets.",
  "project_state.json": "Project state tracking document indicating a fix request to enable dithering in Canvas component by adding 'dithering: true' to gl props and removing a blocking Russian comment in CubeVisualization.tsx.",
  "README_RUSSIAN.md": "Russian-language deployment guide providing overview, requirements (Node.js 18+, dfx, npm/yarn), and quick start instructions for the CyberGenesis virtual land management DApp.",
  "scripts/upload_assets_mainnet.sh": "Mainnet deployment script for uploading GLB model assets to ICP AssetCanister with rate limiting, base64 encoding, error handling, and verification of uploaded assets with stable URL generation.",
  "scripts/upload_assets.sh": "Bash script for batch uploading 48 tiered 3D model GLB files (12 per tier across 4 tiers: Common, Rare, Legendary, Mythic) to the AssetCanister with verification and URL generation.",
  "unknown.txt": "Fragment containing only the text '5. **Test health endpoint:**' with no additional context."
}