{
  "backend/main.mo": "Primary LandCanister actor defining land data types, user state maps, utilities, and core structures for gameplay logic.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for force-reinstalling the Land and Asset canisters on IC mainnet and re-initializing them after backing up state.",
  "DEPLOYMENT_CHECKLIST.md": "High-level checklist outlining required environment setup and variables before deploying the app.",
  "DEPLOYMENT_GUIDE.md": "Mainnet deployment guide describing prerequisites and ordered steps for deploying all canisters and 3D assets.",
  "DEPLOYMENT_INSTRUCTIONS.md": "Brief deployment steps emphasizing correct canister deployment order and environment configuration.",
  "DEVELOPER_README.md": "Developer documentation describing the multi-canister architecture, components, and system overview of the CyberGenesis DApp.",
  "ENVIRONMENT_CONFIGURATION.md": "List of required frontend environment variables and network-related configuration.",
  "ENVIRONMENT_SETUP.md": "Setup guide for configuring environment variables and deploying canisters to resolve common initialization errors.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to required changes, affected files, components, and test references.",
  "frontend-file-summaries.txt": "Generated summaries describing the purpose and behavior of various frontend files and components.",
  "frontend/.env": "Production environment variables for mainnet including canister IDs, admin principal, and stability settings.",
  "frontend/.env.example": "Template environment file showing required variable names, canister IDs, and optional debug settings.",
  "frontend/index.html": "Base HTML entry point loading the root React application and disabling caching.",
  "frontend/src/App.tsx": "Main app component controlling authentication, actor initialization, profile setup flow, and reinitialization UI states.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset backend canister including asset types, user profiles, roles, and all API method signatures.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory defining the asset backend canister interface for asset management, access control, and user profile operations.",
  "frontend/src/backend.idl.ts": "Candid IDL factory for the main backend canister covering land data, rewards, loot cache, modifiers, and various admin and query functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin interface for uploading GLB land models with authorization checks, health checks, and upload progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel enabling GLB file uploads with asset canister health checks, file validation, and upload progress simulation.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostics tool running detailed tests on the asset canister including connectivity, permissions, asset queries, and cycle balances.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Provides a UI workflow to validate authorization, run pre/post checks, and execute asset‑canister reinitialization steps.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs health checks on canisters via multiple gateways and produces status reports with timing, failures, and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays configured canister IDs, compares them to expected values, and highlights mismatches.",
  "frontend/src/components/ConfigValidator.tsx": "Validates essential environment variables and shows blocking errors and warnings when configuration is incomplete.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D cosmic background with stars and nebula effects using a canvas.",
  "frontend/src/components/CubeVisualization.tsx": "3D scene component rendering biome-specific models with custom shaders, lighting, and postprocessing effects.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file exporting nothing after logic was moved elsewhere.",
  "frontend/src/components/DeploymentVerification.tsx": "UI component that checks and displays health status of backend canisters using actors and periodic polling.",
  "frontend/src/components/Discovery.tsx": "Manages loot cache discovery and processing, interacting with backend actors and showing land, balance, and cache actions.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches component errors and displays a styled fallback alert.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting UI using governance-related queries and mutations.",
  "frontend/src/components/LandDashboard.tsx": "Displays land stats, handles reward claims, upgrades, modifiers, and admin debug actions with cooldown logic.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implementation.",
  "frontend/src/components/LandModel.tsx": "Loads a GLTF land model with KTX2 textures, applies emissive and environment settings, and auto-fits the camera once loaded.",
  "frontend/src/components/LandSelector.tsx": "Provides UI to navigate between land entries, showing plot name, biome and index with previous/next buttons.",
  "frontend/src/components/Leaderboard.tsx": "Displays a top‑10 leaderboard of lands with loading, error handling, and token balance formatting.",
  "frontend/src/components/MapView.tsx": "Renders an interactive pannable/zoomable world map on canvas, positioning the view based on the user’s land coordinates.",
  "frontend/src/components/Marketplace.tsx": "Implements marketplace UI with listing filters, buy/list/cancel actions, and dialogs for managing land/modifier listings.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty component placeholder with no implemented logic.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Runs periodic health checks against the asset canister and displays connection status, latency, and uptime with expandable details.",
  "frontend/src/components/ParticleBackground.tsx": "Canvas-based particle animation with colored particles and connecting lines, including resize handling and animation cleanup.",
  "frontend/src/components/PlotCustomization.tsx": "UI for editing a land plot's name and decoration URL using mutation hooks and form inputs.",
  "frontend/src/components/PlugWalletButton.tsx": "Wallet connect button that shows Plug wallet status, allows copying principal, and supports disconnecting.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form that saves a user's name via mutation and displays toast notifications.",
  "frontend/src/components/ReinitializationProgress.tsx": "Fullscreen overlay showing connection retry progress, gateway info, and a loading indicator.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors, logs details, and shows a resettable fallback UI.",
  "frontend/src/config/mainnet.ts": "Mainnet configuration for canister IDs, URLs, feature flags, and helpers for validating and generating model URLs.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides React context for Plug wallet connection, tracking principal, status, and actor creation.",
  "frontend/src/data/modifierCatalog.ts": "Exports a static list of placeholder modifier items with ids, names, rarity tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "TypeScript definitions for governance backend interfaces, proposals, votes, and result variants.",
  "frontend/src/governance-backend.idl.ts": "Defines the Candid IDL for the governance backend service including proposal, vote, and staking methods.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on user identity and invalidates dependent queries.",
  "frontend/src/hooks/useActorReinitializer.ts": "Hook that attempts automatic actor reinitialization with gateway rotation and retry logic.",
  "frontend/src/hooks/useActorWithInit.ts": "Enhanced actor hook that performs initialization checks, polling, and connectivity validation before use.",
  "frontend/src/hooks/useAssetActor.ts": "Initializes an asset canister actor with environment validation, gateway health checks, and retry logic.",
  "frontend/src/hooks/useAssetHealth.ts": "Performs a delayed health check against the asset canister’s /health endpoint and returns its status.",
  "frontend/src/hooks/useAssetUpload.ts": "Provides a GLB file upload function using Plug wallet authentication and the asset canister’s uploadLandModel method.",
  "frontend/src/hooks/useGovernanceActor.ts": "Initializes the governance canister actor with Internet Identity, gateway failover, and retry-based initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity loading, and auth state management.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes the marketplace canister actor with identity support, gateway failover, and retry logic.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides generic and specific Plug Wallet mutation hooks for token, marketplace, and governance canisters with query invalidation and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching land data, user profiles, token balances, and performing related mutations.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes and retries creation of a token canister actor with gateway failover, timeout handling, and Internet Identity integration.",
  "frontend/src/index.css": "Global styles including Tailwind setup, dark theme variables, neon/glass effects, and custom fonts.",
  "frontend/src/lib/buildInfo.ts": "Exports build metadata and utilities for cache busting and logging build information.",
  "frontend/src/lib/debugConfig.ts": "Provides debug utilities for 3D rendering, GPU diagnostics, performance logging, and renderer conflict detection.",
  "frontend/src/lib/modelLoader.ts": "Empty or placeholder file for future model-loading functionality.",
  "frontend/src/lib/tokenUtils.ts": "Provides helper functions to format and parse ICRC‑1 token amounts and add separators, with defaults for an 8‑decimal CBR token.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react‑query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "Contains TypeScript types for the marketplace canister, including listings, item types, and buy/list operations.",
  "frontend/src/marketplace-backend.idl.ts": "Defines the Candid IDL for the marketplace canister, including item types, listings, and service methods.",
  "frontend/src/pages/Collection.tsx": "Renders the modifier collection catalog with tier counts, styling helpers, and a grid display.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that loads land data, manages tab navigation, and displays various game modules.",
  "frontend/src/pages/LandingPage.tsx": "Landing page enabling Internet Identity login with animated UI and error handling.",
  "frontend/src/pages/MintingPage.tsx": "Shows loading state for land initialization and confirms successful minting before redirecting.",
  "frontend/src/pages/VerificationPage.tsx": "Displays a canister‑ID verification tool with background visuals and a link back home.",
  "frontend/src/token-backend.d.ts": "TypeScript definitions for the token canister, including accounts, transfers, metadata, and admin controls.",
  "frontend/src/token-backend.idl.ts": "Defines the IDL factory for token-related canister methods including balance, transfer, metadata, supply, and mint.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript type declarations for the WebGPU API to enable compile-time support and feature detection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, plugins, and extended theme settings for the frontend.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variables, build timestamping, asset handling fixes, and dev server configuration.",
  "project_state.json": "Captures project state, required visual calibration changes, and tracked feature requests for rendering adjustments.",
  "README_RUSSIAN.md": "Russian‑language deployment overview with prerequisites and quick‑start steps for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Bash script that uploads .glb model assets to an ICP mainnet asset canister with validation, rate limiting, and post‑upload verification.",
  "scripts/upload_assets.sh": "Bash script that batch-uploads tiered 3D model assets to the AssetCanister via dfx, with verification and logging.",
  "unknown.txt": "Contains a brief instruction referencing testing a health endpoint."
}