{
  "backend/main.mo": "Primary LandCanister backend implementing land data structures, user profiles, loot, modifiers, and gameplay logic.",
  "CANISTER_REINSTALL_GUIDE.md": "Instructions for fully reinstalling Land and Asset canisters on mainnet and reinitializing them after backing up state.",
  "DEPLOYMENT_CHECKLIST.md": "Pre-deployment checklist covering environment configuration and required variables before deploying the app.",
  "DEPLOYMENT_GUIDE.md": "Guide detailing the sequence for deploying the CyberGenesis Land Mint DApp and its canisters to mainnet.",
  "DEPLOYMENT_INSTRUCTIONS.md": "High-level deployment steps emphasizing correct canister deployment order and environment setup.",
  "DEVELOPER_README.md": "Developer documentation describing project architecture, multi‑canister system design, and component responsibilities.",
  "ENVIRONMENT_CONFIGURATION.md": "Brief guide listing required environment variables for the frontend .env file.",
  "ENVIRONMENT_SETUP.md": "Setup guide explaining environment configuration and backend canister deployment to resolve common errors.",
  "feature_evidence.json": "Feature evidence report describing required Bloom implementation changes in CubeVisualization.tsx.",
  "frontend-file-summaries.txt": "Generated summaries of all frontend source files and their roles in the application.",
  "frontend/.env": "Mainnet environment configuration with canister IDs, stability settings, and admin authorization for uploads.",
  "frontend/.env.example": "Template environment file showing required variables, canister IDs, and debug options for different networks.",
  "frontend/index.html": "Simple HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, profile setup, and reinitialization UI states.",
  "frontend/src/asset-backend.d.ts": "TypeScript definitions for the asset canister interface, including asset types, user roles, and admin operations.",
  "frontend/src/asset-backend.idl.ts": "Candid IDL factory describing the asset canister’s asset management, admin, access control, and user profile methods.",
  "frontend/src/backend.idl.ts": "Candid IDL for the main backend canister defining land data, rewards, modifiers, caches, upgrades, and user/profile functions.",
  "frontend/src/components/AdminGLBUpload.tsx": "Admin-only tool for uploading GLB models with health checks, authorization, drag‑and‑drop, and progress tracking.",
  "frontend/src/components/AdminPanel.tsx": "Admin UI for health‑checking the asset canister and uploading GLB files with validation and progress simulation.",
  "frontend/src/components/AssetCanisterDiagnostics.tsx": "Diagnostics tool performing multi‑step tests on asset and land canisters, logging results and checking cycles and permissions.",
  "frontend/src/components/AssetCanisterReinitializer.tsx": "Admin-only UI logic for running pre-checks and reinitialization steps on the Asset Canister, including status tracking and authorization checks.",
  "frontend/src/components/CanisterDiagnostics.tsx": "Runs health checks against multiple gateways for Land and Asset canisters, measuring response times and generating status reports and recommendations.",
  "frontend/src/components/CanisterIDVerification.tsx": "Displays whether environment variables for canister IDs match expected values and highlights any mismatches.",
  "frontend/src/components/ConfigValidator.tsx": "Validates required environment variables at runtime and shows a fixed error banner with missing or invalid config details.",
  "frontend/src/components/CosmicBackground.tsx": "Renders an animated 2D cosmic starfield and nebula background using an HTML canvas.",
  "frontend/src/components/CubeVisualization.tsx": "Renders biome-specific 3D land models with Three.js, including lighting sync and a custom bloom post-processing pipeline.",
  "frontend/src/components/CyberCube.tsx": "Empty placeholder file; all 3D logic was moved elsewhere.",
  "frontend/src/components/DeploymentVerification.tsx": "Checks health of system canisters, displays their status, and refreshes results with actor calls and query invalidation.",
  "frontend/src/components/Discovery.tsx": "Handles loot cache discovery and processing logic, including token cost checks, actor calls, and UI state for operations.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches component errors and displays a styled fallback message.",
  "frontend/src/components/Governance.tsx": "Implements staking, proposal creation, and voting workflows using actor queries and mutation handlers.",
  "frontend/src/components/LandDashboard.tsx": "Displays land stats, reward claiming, upgrades, and modifier actions with cooldown tracking and admin debugging tools.",
  "frontend/src/components/LandDataDisplay.tsx": "Empty file with no implemented logic.",
  "frontend/src/components/LandModel.tsx": "Loads a GLTF land model with KTX2 textures, applies biome-based PBR material tweaks, and auto-fits the camera to the model.",
  "frontend/src/components/LandSelector.tsx": "Displays navigation UI for selecting between land plots, showing name, biome translation, and index.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays the top 10 lands ranked by token balance with styled placement indicators.",
  "frontend/src/components/MapView.tsx": "Renders an interactive map canvas with drag, zoom, and pinch controls, centering on the user’s land and drawing biome markers.",
  "frontend/src/components/Marketplace.tsx": "Shows active marketplace listings with filtering, buying, and listing functionality for lands and modifiers.",
  "frontend/src/components/MatrixAnimation.tsx": "Empty component file with no implementation.",
  "frontend/src/components/NetworkDiagnostics.tsx": "Performs periodic health checks on the asset canister and displays connection status, latency, and uptime.",
  "frontend/src/components/ParticleBackground.tsx": "Renders a full‑screen animated 2D canvas with moving particles and connecting lines, including resize handling and animation cleanup.",
  "frontend/src/components/PlotCustomization.tsx": "Provides UI to edit a land plot’s name and decoration URL, syncing with backend mutations and showing loading states.",
  "frontend/src/components/PlugWalletButton.tsx": "Displays a Plug wallet connect button or account menu with copy and disconnect actions based on connection state.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile creation form that saves a user’s name via mutation and shows success or error toasts.",
  "frontend/src/components/ReinitializationProgress.tsx": "Full‑screen overlay showing connection retry progress, active gateway, and a visual progress bar.",
  "frontend/src/components/ThreeErrorBoundary.tsx": "Error boundary that catches 3D rendering errors, logs them, shows a fallback UI, and allows reset.",
  "frontend/src/config/mainnet.ts": "Defines mainnet configuration for canister IDs, URLs, feature flags, and helpers for initialization and validation.",
  "frontend/src/contexts/PlugWalletContext.tsx": "Provides a React context for managing Plug wallet connection state, actor creation, and connect/disconnect actions.",
  "frontend/src/data/modifierCatalog.ts": "Defines a static list of placeholder modifier items with IDs, names, tiers, and asset URLs.",
  "frontend/src/governance-backend.d.ts": "TypeScript definitions for governance backend interfaces, including proposals, votes, and staking/voting result types.",
  "frontend/src/governance-backend.idl.ts": "Candid IDL factory describing the governance backend service, records, and variant result types.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorReinitializer.ts": "Provides automatic actor reinitialization with retry logic, gateway rotation, and status tracking.",
  "frontend/src/hooks/useActorWithInit.ts": "Hook combining actor retrieval with initialization checks and progressive polling to verify backend readiness.",
  "frontend/src/hooks/useAssetActor.ts": "Initializes an asset canister actor with environment validation, gateway health checks, and retry logic. Provides automatic failover across IC gateways and ensures stable agent setup.",
  "frontend/src/hooks/useAssetHealth.ts": "Checks the asset canister’s /health endpoint with a delay and timeout, returning a simple health status. Updates state based on fetch success or failure.",
  "frontend/src/hooks/useAssetUpload.ts": "Uploads GLB files to the asset canister using Plug wallet authentication and reports progress. Converts file bytes and calls uploadLandModel on the canister actor.",
  "frontend/src/hooks/useGovernanceActor.ts": "Creates a governance canister actor with retry, timeout, and gateway selection logic. Uses Internet Identity for authentication and handles initialization state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity authentication via AuthClient. Handles login, stored identity loading, logout, and status tracking.",
  "frontend/src/hooks/useMarketplaceActor.ts": "Initializes a marketplace canister actor with retries, failover gateway selection, and identity support. Manages loading, errors, and agent configuration.",
  "frontend/src/hooks/usePlugWalletQueries.ts": "Provides React Query mutation hooks using Plug Wallet to create actors and execute token, marketplace, and governance transactions with automatic query invalidation and error toasts.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating land data, user profiles, token balances, and placeholder governance/marketplace types via authenticated actors.",
  "frontend/src/hooks/useTokenActor.ts": "Initializes a token canister actor with retry, gateway failover, and timeout logic using the user's Internet Identity.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet defining dark theme variables, fonts, neon effects, and glassmorphism UI styling.",
  "frontend/src/lib/buildInfo.ts": "Exports build metadata and utilities for cache-busting URLs and logging build information.",
  "frontend/src/lib/debugConfig.ts": "Implements global debug utilities for 3D rendering, including logging, GPU diagnostics, performance metrics, and renderer detection.",
  "frontend/src/lib/modelLoader.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/tokenUtils.ts": "Provides helpers to format and parse ICRC‑1 token amounts with decimal handling and thousand separators.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/marketplace-backend.d.ts": "Type definitions for the marketplace canister, including listings, buy results, and service methods.",
  "frontend/src/marketplace-backend.idl.ts": "Candid IDL factory defining the marketplace canister interface, types, and query/mutation methods.",
  "frontend/src/pages/Collection.tsx": "Renders the full modifier collection with rarity tiers, counts, and styled cards.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard handling land data loading, tab navigation, and rendering various game components.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login flow and animated visual backgrounds.",
  "frontend/src/pages/MintingPage.tsx": "Displays land initialization status and loader while waiting for land data to be ready.",
  "frontend/src/pages/VerificationPage.tsx": "Page for verifying configured canister IDs with a dedicated verification component.",
  "frontend/src/token-backend.d.ts": "Type definitions for the token canister including accounts, transfers, errors, metadata, and admin methods.",
  "frontend/src/token-backend.idl.ts": "Defines IDL types and service methods for token operations including balance, transfer, metadata, total supply, and minting.",
  "frontend/src/types/webgpu.d.ts": "Provides TypeScript type declarations for WebGPU interfaces to enable API usage without compiler errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, storing them in sessionStorage, retrieving persisted values, and cleaning URL hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and container settings with plugin integration.",
  "frontend/vite.config.ts": "Vite config setting up React, environment variables, build timestamped asset naming, WASM handling, and dev server proxying.",
  "project_state.json": "Tracks project state, goals, architecture notes, and known issues for a 3D React/Three.js app with custom bloom and rendering rules.",
  "README_RUSSIAN.md": "Russian‑language deployment overview with prerequisites and quick start steps for CyberGenesis.",
  "scripts/upload_assets_mainnet.sh": "Bash script that uploads .glb model files to an ICP mainnet asset canister, handling validation, base64 conversion, rate limiting, and post‑upload verification.",
  "scripts/upload_assets.sh": "Shell script to batch‑upload GLB model assets to an AssetCanister using dfx and verify uploaded files.",
  "unknown.txt": "Contains a brief instruction referencing testing a health endpoint."
}