{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement Visual Engine finalization with Artist Workshop HDRI and biome-specific lighting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace Environment component HDRI URL in CubeVisualization.tsx with Artist Workshop HDRI and set environmentIntensity to 1.0 and blur to 0",
      "acceptanceCriteria": [
        "Environment component uses the artist_workshop_1k.hdr HDRI file",
        "environmentIntensity is set to exactly 1.0",
        "blur property is set to 0"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CubeVisualization.tsx",
          "operation": "modify",
          "description": "Update the Environment component to use the Artist Workshop HDRI from Poly Haven. Replace the existing files prop URL with 'https://dl.polyhaven.org/file/ph-assets/HDRIs/hdr/1k/artist_workshop_1k.hdr', set environmentIntensity={1.0}, and set blur={0}. Locate the Environment component within the Canvas and update only these three props without modifying other scene settings like Bloom, Anisotropy, DPR, or Dithering."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement biome-specific lighting configuration in LandModel.tsx traverse loop with env and emissive values for all land types",
      "acceptanceCriteria": [
        "Settings object defined with all 6 biome types plus DEFAULT fallback",
        "Each biome has correct env and emissive values as specified",
        "Config is applied inside traverse: const config = settings[landType] || settings.DEFAULT",
        "Material properties set: child.material.envMapIntensity = config.env and child.material.userData.baseEmissive = config.emissive"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LandModel.tsx",
          "operation": "modify",
          "description": "Add a biome-specific lighting configuration object that maps land types to env and emissive values. Define the settings object with these exact mappings: MYTHIC_VOID {env: 3.0, emissive: 7.5}, ISLAND_ARCHIPELAGO {env: 3.0, emissive: 6.0}, DESERT_DUNE {env: 1.0, emissive: 6.2}, VOLCANIC_CRAG {env: 1.5, emissive: 6.6}, FOREST_VALLEY {env: 1.0, emissive: 2.5}, MYTHIC_AETHER {env: 1.0, emissive: 5.5}, DEFAULT {env: 1.0, emissive: 3.2}. In the traverse loop where materials are processed, apply the configuration by retrieving const config = settings[landType] || settings.DEFAULT, then set child.material.envMapIntensity = config.env and store child.material.userData.baseEmissive = config.emissive for later use in the pulse animation. Ensure this logic only applies to materials with emissive maps or colors as specified in the constraints."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update pulse animation logic in LandModel.tsx useFrame hook to use new formula with stored baseEmissive values",
      "acceptanceCriteria": [
        "Pulse calculation uses Math.sin(state.clock.elapsedTime * 0.8) * 0.25 added to 1.0",
        "emissiveIntensity multiplies the stored baseEmissive value (or 3.2 default) by pulse",
        "Pulse logic only applies to materials with emissive map or color as specified in constraints"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LandModel.tsx",
          "operation": "modify",
          "description": "Update the pulse animation logic in the useFrame hook (around line 153) to use the new formula. Replace the existing pulse calculation with: const pulse = 1.0 + Math.sin(state.clock.elapsedTime * 0.8) * 0.25. Then update the emissiveIntensity assignment to: child.material.emissiveIntensity = (child.material.userData.baseEmissive || 3.2) * pulse. This retrieves the biome-specific baseEmissive value stored during the traverse loop in REQ-2 and applies the oscillating pulse multiplier. Ensure this logic only applies to materials that have an emissive map or emissive color, as specified in the constraints. Do not modify Bloom threshold, Anisotropy, Dithering, or DPR settings."
        }
      ]
    }
  ]
}